[Killed] EqualityOperator
controllers/groups.js:31:28
     try {
         const { category, group, description } = req.body;
 
-        const groupCheck = await Groups.findOne({ group }) === null;
+        const groupCheck = (await Groups.findOne({
+  group
+})) !== null;
         
         if (groupCheck) {
killedBy: Groups Controller addGroup should redirect to group admin page if group is added successfully
statusReason: expected false to be true

[Killed] BlockStatement
controllers/groups.js:53:73
 
         const groupData = await Groups.findOne({ group });
 
-        if (groupData === null || groupData.group === req.params.group) {
-            const query = { group: req.params.group };
-            await Groups.updateOne (query, { category, group, description });
-            return res.redirect(`/admin`);
-        } else {
+        if (groupData === null || groupData.group === req.params.group) {} else {
             req.flash('error', 'This group already exists in our database. Please update the existing group or choose a different group name.');
             return req.session.save(error => error ? next(error) : res.redirect(`/${encodeURIComponent(req.params.group)}/admin/update-group-form`));
killedBy: Groups Controller updateGroup should redirect to admin page if group is updated successfully
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/groups.js:79:27
     try {
 
         const { group, coin, coinLogoLink, description, imageLink } = req.body
-        const coinCheck = await Coins.findOne({ coin }) === null;
+        const coinCheck = false;
 
         if (coinCheck) {
killedBy: Groups Controller addCoin should redirect to coin admin page if coin is added successfully
statusReason: expected false to be true
