[Killed] BlockStatement
controllers/admin/forms.js:8:39
 const __filename = fileURLToPath(import.meta.url); 
 const __dirname = path.dirname(__filename);
 
-const getAddGroupForm = (req, res) => {
-    return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'forms', 'add_group.ejs'), 
-        { 
-            errorMessage: req.flash('error')[0],
-            oldInput: req.session.oldInput || {} 
-        });
-}
+const getAddGroupForm = (req, res) => {}
 
 const getUpdateGroupForm = (req, res) => {
killedBy: Get Admin Forms Group Form Add Group Form - renders form with expected arguments
statusReason: expected false to be true

[Survived] StringLiteral
controllers/admin/forms.js:11:37
 const getAddGroupForm = (req, res) => {
     return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'forms', 'add_group.ejs'), 
         { 
-            errorMessage: req.flash('error')[0],
+            errorMessage: req.flash("")[0],
             oldInput: req.session.oldInput || {} 
         });

[Killed] ConditionalExpression
controllers/admin/forms.js:12:23
     return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'forms', 'add_group.ejs'), 
         { 
             errorMessage: req.flash('error')[0],
-            oldInput: req.session.oldInput || {} 
+            oldInput: true 
         });
 }
killedBy: Get Admin Forms Group Form Add Group Form - renders form with expected arguments
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/admin/forms.js:12:23
     return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'forms', 'add_group.ejs'), 
         { 
             errorMessage: req.flash('error')[0],
-            oldInput: req.session.oldInput || {} 
+            oldInput: false 
         });
 }
killedBy: Get Admin Forms Group Form Add Group Form - renders form with expected arguments
statusReason: expected false to be true

[Killed] BlockStatement
controllers/admin/forms.js:16:42
         });
 }
 
-const getUpdateGroupForm = (req, res) => {
-
-    const { groups } = res.locals;
-    const filteredGroup = groups.filter(group => group.group === req.params.group )
-    const noGroupFound = filteredGroup.length === 0;
-
-    if (noGroupFound) {
-        return res.status(404).render(path.join(__dirname, '..', '..', 'views', '404.ejs'));
-    } else {
-        const { category, group, description } = filteredGroup[0];
-        return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'forms', 'update_group.ejs'), 
-            { 
-                category, 
-                group, 
-                description,            
-                errorMessage: req.flash('error')[0],
-            });
-    }
-}
+const getUpdateGroupForm = (req, res) => {}
 
 const getAddCoinForm = (req, res) => {
killedBy: Get Admin Forms Group Form Update Group Form - renders a 404 page when the specified group is not found
statusReason: expected false to be true

[Killed] MethodExpression
controllers/admin/forms.js:19:27
 const getUpdateGroupForm = (req, res) => {
 
     const { groups } = res.locals;
-    const filteredGroup = groups.filter(group => group.group === req.params.group )
+    const filteredGroup = groups
     const noGroupFound = filteredGroup.length === 0;
 
killedBy: Get Admin Forms Group Form Update Group Form - renders a 404 page when the specified group is not found
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/admin/forms.js:19:50
 const getUpdateGroupForm = (req, res) => {
 
     const { groups } = res.locals;
-    const filteredGroup = groups.filter(group => group.group === req.params.group )
+    const filteredGroup = groups.filter(group => false )
     const noGroupFound = filteredGroup.length === 0;
 
killedBy: Get Admin Forms Group Form Update Group Form renders the Update Group form with expected arguments when the specified group is found
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/admin/forms.js:20:26
 
     const { groups } = res.locals;
     const filteredGroup = groups.filter(group => group.group === req.params.group )
-    const noGroupFound = filteredGroup.length === 0;
+    const noGroupFound = false;
 
     if (noGroupFound) {
killedBy: Get Admin Forms Group Form Update Group Form - renders a 404 page when the specified group is not found
statusReason: Cannot destructure property 'category' of 'filteredGroup[0]' as it is undefined.

[Killed] EqualityOperator
controllers/admin/forms.js:20:26
 
     const { groups } = res.locals;
     const filteredGroup = groups.filter(group => group.group === req.params.group )
-    const noGroupFound = filteredGroup.length === 0;
+    const noGroupFound = filteredGroup.length !== 0;
 
     if (noGroupFound) {
killedBy: Get Admin Forms Group Form Update Group Form - renders a 404 page when the specified group is not found
statusReason: Cannot destructure property 'category' of 'filteredGroup[0]' as it is undefined.

[Killed] BlockStatement
controllers/admin/forms.js:22:23
     const filteredGroup = groups.filter(group => group.group === req.params.group )
     const noGroupFound = filteredGroup.length === 0;
 
-    if (noGroupFound) {
-        return res.status(404).render(path.join(__dirname, '..', '..', 'views', '404.ejs'));
-    } else {
+    if (noGroupFound) {} else {
         const { category, group, description } = filteredGroup[0];
         return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'forms', 'update_group.ejs'), 
killedBy: Get Admin Forms Group Form Update Group Form - renders a 404 page when the specified group is not found
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/admin/forms.js:22:9
     const filteredGroup = groups.filter(group => group.group === req.params.group )
     const noGroupFound = filteredGroup.length === 0;
 
-    if (noGroupFound) {
+    if (false) {
         return res.status(404).render(path.join(__dirname, '..', '..', 'views', '404.ejs'));
     } else {
killedBy: Get Admin Forms Group Form Update Group Form - renders a 404 page when the specified group is not found
statusReason: Cannot destructure property 'category' of 'filteredGroup[0]' as it is undefined.

[Killed] BlockStatement
controllers/admin/forms.js:24:12
 
     if (noGroupFound) {
         return res.status(404).render(path.join(__dirname, '..', '..', 'views', '404.ejs'));
-    } else {
-        const { category, group, description } = filteredGroup[0];
-        return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'forms', 'update_group.ejs'), 
-            { 
-                category, 
-                group, 
-                description,            
-                errorMessage: req.flash('error')[0],
-            });
-    }
+    } else {}
 }
 
killedBy: Get Admin Forms Group Form Update Group Form renders the Update Group form with expected arguments when the specified group is found
statusReason: expected false to be true

[Killed] StringLiteral
controllers/admin/forms.js:26:54
         return res.status(404).render(path.join(__dirname, '..', '..', 'views', '404.ejs'));
     } else {
         const { category, group, description } = filteredGroup[0];
-        return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'forms', 'update_group.ejs'), 
+        return res.render(path.join(__dirname, '..', "", 'views', 'admin', 'forms', 'update_group.ejs'), 
             { 
                 category, 
killedBy: Get Admin Forms Group Form Update Group Form renders the Update Group form with expected arguments when the specified group is found
statusReason: expected false to be true

[Killed] ObjectLiteral
controllers/admin/forms.js:27:13
     } else {
         const { category, group, description } = filteredGroup[0];
         return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'forms', 'update_group.ejs'), 
-            { 
-                category, 
-                group, 
-                description,            
-                errorMessage: req.flash('error')[0],
-            });
+            {});
     }
 }
killedBy: Get Admin Forms Group Form Update Group Form renders the Update Group form with expected arguments when the specified group is found
statusReason: expected false to be true

[Killed] BlockStatement
controllers/admin/forms.js:36:38
     }
 }
 
-const getAddCoinForm = (req, res) => {
-    const { categories, groups } = res.locals;
-    const noCategories = groups.length === 0;
-    const noGroupFound = groups.length === 0;
-
-    if (noCategories || noGroupFound) {
-        return res.status(404).render(path.join(__dirname, '..', '..', 'views', '404.ejs'));
-    } else {
-        return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'forms', 'add_coin.ejs'), 
-            { 
-                categories, 
-                groups, 
-                errorMessage: req.flash('error')[0],
-                oldInput: req.session.oldInput || {} 
-            });
-    }
-}
+const getAddCoinForm = (req, res) => {}
 
 const getUpdateCoinForm = async(req, res, next) => {
killedBy: Get Admin Forms Coin Form Add Coin Form - renders a 404 page when there are no categories or groups
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/admin/forms.js:38:26
 
 const getAddCoinForm = (req, res) => {
     const { categories, groups } = res.locals;
-    const noCategories = groups.length === 0;
+    const noCategories = true;
     const noGroupFound = groups.length === 0;
 
killedBy: Get Admin Forms Coin Form Add Coin Form - renders the Add Coin form with expected arguments when there are categories and groups
statusReason: expected false to be true

[Killed] EqualityOperator
controllers/admin/forms.js:38:26
 
 const getAddCoinForm = (req, res) => {
     const { categories, groups } = res.locals;
-    const noCategories = groups.length === 0;
+    const noCategories = groups.length !== 0;
     const noGroupFound = groups.length === 0;
 
killedBy: Get Admin Forms Coin Form Add Coin Form - renders the Add Coin form with expected arguments when there are categories and groups
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/admin/forms.js:39:26
 const getAddCoinForm = (req, res) => {
     const { categories, groups } = res.locals;
     const noCategories = groups.length === 0;
-    const noGroupFound = groups.length === 0;
+    const noGroupFound = true;
 
     if (noCategories || noGroupFound) {
killedBy: Get Admin Forms Coin Form Add Coin Form - renders the Add Coin form with expected arguments when there are categories and groups
statusReason: expected false to be true

[Killed] EqualityOperator
controllers/admin/forms.js:39:26
 const getAddCoinForm = (req, res) => {
     const { categories, groups } = res.locals;
     const noCategories = groups.length === 0;
-    const noGroupFound = groups.length === 0;
+    const noGroupFound = groups.length !== 0;
 
     if (noCategories || noGroupFound) {
killedBy: Get Admin Forms Coin Form Add Coin Form - renders the Add Coin form with expected arguments when there are categories and groups
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/admin/forms.js:41:9
     const noCategories = groups.length === 0;
     const noGroupFound = groups.length === 0;
 
-    if (noCategories || noGroupFound) {
+    if (false) {
         return res.status(404).render(path.join(__dirname, '..', '..', 'views', '404.ejs'));
     } else {
killedBy: Get Admin Forms Coin Form Add Coin Form - renders a 404 page when there are no categories or groups
statusReason: expected false to be true

[Killed] BlockStatement
controllers/admin/forms.js:41:39
     const noCategories = groups.length === 0;
     const noGroupFound = groups.length === 0;
 
-    if (noCategories || noGroupFound) {
-        return res.status(404).render(path.join(__dirname, '..', '..', 'views', '404.ejs'));
-    } else {
+    if (noCategories || noGroupFound) {} else {
         return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'forms', 'add_coin.ejs'), 
             { 
killedBy: Get Admin Forms Coin Form Add Coin Form - renders a 404 page when there are no categories or groups
statusReason: expected false to be true

[Killed] StringLiteral
controllers/admin/forms.js:42:72
     const noGroupFound = groups.length === 0;
 
     if (noCategories || noGroupFound) {
-        return res.status(404).render(path.join(__dirname, '..', '..', 'views', '404.ejs'));
+        return res.status(404).render(path.join(__dirname, '..', '..', "", '404.ejs'));
     } else {
         return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'forms', 'add_coin.ejs'), 
killedBy: Get Admin Forms Coin Form Add Coin Form - renders a 404 page when there are no categories or groups
statusReason: expected false to be true

[Killed] StringLiteral
controllers/admin/forms.js:42:66
     const noGroupFound = groups.length === 0;
 
     if (noCategories || noGroupFound) {
-        return res.status(404).render(path.join(__dirname, '..', '..', 'views', '404.ejs'));
+        return res.status(404).render(path.join(__dirname, '..', "", 'views', '404.ejs'));
     } else {
         return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'forms', 'add_coin.ejs'), 
killedBy: Get Admin Forms Coin Form Add Coin Form - renders a 404 page when there are no categories or groups
statusReason: expected false to be true

[Killed] BlockStatement
controllers/admin/forms.js:43:12
 
     if (noCategories || noGroupFound) {
         return res.status(404).render(path.join(__dirname, '..', '..', 'views', '404.ejs'));
-    } else {
-        return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'forms', 'add_coin.ejs'), 
-            { 
-                categories, 
-                groups, 
-                errorMessage: req.flash('error')[0],
-                oldInput: req.session.oldInput || {} 
-            });
-    }
+    } else {}
 }
 
killedBy: Get Admin Forms Coin Form Add Coin Form - renders the Add Coin form with expected arguments when there are categories and groups
statusReason: expected false to be true

[Killed] StringLiteral
controllers/admin/forms.js:44:78
     if (noCategories || noGroupFound) {
         return res.status(404).render(path.join(__dirname, '..', '..', 'views', '404.ejs'));
     } else {
-        return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'forms', 'add_coin.ejs'), 
+        return res.render(path.join(__dirname, '..', '..', 'views', 'admin', "", 'add_coin.ejs'), 
             { 
                 categories, 
killedBy: Get Admin Forms Coin Form Add Coin Form - renders the Add Coin form with expected arguments when there are categories and groups
statusReason: expected false to be true

[Killed] BlockStatement
controllers/admin/forms.js:54:52
     }
 }
 
-const getUpdateCoinForm = async(req, res, next) => {
-    try {
-        const { groups } = res.locals;
-        const filteredGroup = groups.filter(group => group.group === req.params.group);
-        const filteredCoin = filteredGroup[0].coins.filter(coin => coin.coin === req.params.coin);
-        const coinData = await Coins.findOne({ coin: req.params.coin});
-        const { description, imageLink } = coinData;
-        return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'forms', 'update_coin.ejs'), { 
-            group: req.params.group, 
-            paramsCoin: req.params.coin, 
-            coin: filteredCoin[0].coin,
-            coinLogoLink: filteredCoin[0].coinLogoLink,
-            description, 
-            imageLink,
-            errorMessage: req.flash('error')[0]
-        });
-    } catch (error) {
-        next(error)
-    }
-};
+const getUpdateCoinForm = async(req, res, next) => {};
 
 const getAddResourceForm = async (req, res, next) => {
killedBy: Get Admin Forms Coin Form Update Coin Form - renders form with expected arguments
statusReason: expected false to be true

[Killed] BlockStatement
controllers/admin/forms.js:55:9
 }
 
 const getUpdateCoinForm = async(req, res, next) => {
-    try {
-        const { groups } = res.locals;
-        const filteredGroup = groups.filter(group => group.group === req.params.group);
-        const filteredCoin = filteredGroup[0].coins.filter(coin => coin.coin === req.params.coin);
-        const coinData = await Coins.findOne({ coin: req.params.coin});
-        const { description, imageLink } = coinData;
-        return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'forms', 'update_coin.ejs'), { 
-            group: req.params.group, 
-            paramsCoin: req.params.coin, 
-            coin: filteredCoin[0].coin,
-            coinLogoLink: filteredCoin[0].coinLogoLink,
-            description, 
-            imageLink,
-            errorMessage: req.flash('error')[0]
-        });
-    } catch (error) {
+    try {} catch (error) {
         next(error)
     }
killedBy: Get Admin Forms Coin Form Update Coin Form - renders form with expected arguments
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/admin/forms.js:57:54
 const getUpdateCoinForm = async(req, res, next) => {
     try {
         const { groups } = res.locals;
-        const filteredGroup = groups.filter(group => group.group === req.params.group);
+        const filteredGroup = groups.filter(group => false);
         const filteredCoin = filteredGroup[0].coins.filter(coin => coin.coin === req.params.coin);
         const coinData = await Coins.findOne({ coin: req.params.coin});
killedBy: Get Admin Forms Coin Form Update Coin Form - renders form with expected arguments
statusReason: next is not a function

[Killed] EqualityOperator
controllers/admin/forms.js:57:54
 const getUpdateCoinForm = async(req, res, next) => {
     try {
         const { groups } = res.locals;
-        const filteredGroup = groups.filter(group => group.group === req.params.group);
+        const filteredGroup = groups.filter(group => group.group !== req.params.group);
         const filteredCoin = filteredGroup[0].coins.filter(coin => coin.coin === req.params.coin);
         const coinData = await Coins.findOne({ coin: req.params.coin});
killedBy: Get Admin Forms Coin Form Update Coin Form - renders form with expected arguments
statusReason: next is not a function

[Killed] EqualityOperator
controllers/admin/forms.js:58:68
     try {
         const { groups } = res.locals;
         const filteredGroup = groups.filter(group => group.group === req.params.group);
-        const filteredCoin = filteredGroup[0].coins.filter(coin => coin.coin === req.params.coin);
+        const filteredCoin = filteredGroup[0].coins.filter(coin => coin.coin !== req.params.coin);
         const coinData = await Coins.findOne({ coin: req.params.coin});
         const { description, imageLink } = coinData;
killedBy: Get Admin Forms Coin Form Update Coin Form - renders form with expected arguments
statusReason: next is not a function

[Killed] ConditionalExpression
controllers/admin/forms.js:58:68
     try {
         const { groups } = res.locals;
         const filteredGroup = groups.filter(group => group.group === req.params.group);
-        const filteredCoin = filteredGroup[0].coins.filter(coin => coin.coin === req.params.coin);
+        const filteredCoin = filteredGroup[0].coins.filter(coin => false);
         const coinData = await Coins.findOne({ coin: req.params.coin});
         const { description, imageLink } = coinData;
killedBy: Get Admin Forms Coin Form Update Coin Form - renders form with expected arguments
statusReason: next is not a function

[Killed] StringLiteral
controllers/admin/forms.js:61:54
         const filteredCoin = filteredGroup[0].coins.filter(coin => coin.coin === req.params.coin);
         const coinData = await Coins.findOne({ coin: req.params.coin});
         const { description, imageLink } = coinData;
-        return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'forms', 'update_coin.ejs'), { 
+        return res.render(path.join(__dirname, '..', "", 'views', 'admin', 'forms', 'update_coin.ejs'), { 
             group: req.params.group, 
             paramsCoin: req.params.coin, 
killedBy: Get Admin Forms Coin Form Update Coin Form - renders form with expected arguments
statusReason: expected false to be true

[Killed] StringLiteral
controllers/admin/forms.js:61:60
         const filteredCoin = filteredGroup[0].coins.filter(coin => coin.coin === req.params.coin);
         const coinData = await Coins.findOne({ coin: req.params.coin});
         const { description, imageLink } = coinData;
-        return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'forms', 'update_coin.ejs'), { 
+        return res.render(path.join(__dirname, '..', '..', "", 'admin', 'forms', 'update_coin.ejs'), { 
             group: req.params.group, 
             paramsCoin: req.params.coin, 
killedBy: Get Admin Forms Coin Form Update Coin Form - renders form with expected arguments
statusReason: expected false to be true

[NoCoverage] BlockStatement
controllers/admin/forms.js:70:21
             imageLink,
             errorMessage: req.flash('error')[0]
         });
-    } catch (error) {
-        next(error)
-    }
+    } catch (error) {}
 };
 

[Killed] BlockStatement
controllers/admin/forms.js:75:54
     }
 };
 
-const getAddResourceForm = async (req, res, next) => {
-    try {
-        const { group, coin } = req.params;
-        return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'forms', 'add_resource.ejs'), { group, coin });
-    } catch (error) {
-        next(error);
-    }
-}
+const getAddResourceForm = async (req, res, next) => {}
 
 const getUpdateResourceForm = async (req, res, next) => {
killedBy: Get Admin Forms Resource Form Add Resource Form - renders form with expected arguments
statusReason: expected false to be true

[Killed] BlockStatement
controllers/admin/forms.js:76:9
 };
 
 const getAddResourceForm = async (req, res, next) => {
-    try {
-        const { group, coin } = req.params;
-        return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'forms', 'add_resource.ejs'), { group, coin });
-    } catch (error) {
+    try {} catch (error) {
         next(error);
     }
killedBy: Get Admin Forms Resource Form Add Resource Form - renders form with expected arguments
statusReason: expected false to be true

[Killed] StringLiteral
controllers/admin/forms.js:78:60
 const getAddResourceForm = async (req, res, next) => {
     try {
         const { group, coin } = req.params;
-        return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'forms', 'add_resource.ejs'), { group, coin });
+        return res.render(path.join(__dirname, '..', '..', "", 'admin', 'forms', 'add_resource.ejs'), { group, coin });
     } catch (error) {
         next(error);
killedBy: Get Admin Forms Resource Form Add Resource Form - renders form with expected arguments
statusReason: expected false to be true

[Killed] StringLiteral
controllers/admin/forms.js:78:78
 const getAddResourceForm = async (req, res, next) => {
     try {
         const { group, coin } = req.params;
-        return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'forms', 'add_resource.ejs'), { group, coin });
+        return res.render(path.join(__dirname, '..', '..', 'views', 'admin', "", 'add_resource.ejs'), { group, coin });
     } catch (error) {
         next(error);
killedBy: Get Admin Forms Resource Form Add Resource Form - renders form with expected arguments
statusReason: expected false to be true

[NoCoverage] BlockStatement
controllers/admin/forms.js:79:21
     try {
         const { group, coin } = req.params;
         return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'forms', 'add_resource.ejs'), { group, coin });
-    } catch (error) {
-        next(error);
-    }
+    } catch (error) {}
 }
 

[Killed] BlockStatement
controllers/admin/forms.js:84:57
     }
 }
 
-const getUpdateResourceForm = async (req, res, next) => {
-    try {
-        const coinData = await Coins.findOne({ coin: req.params.coin });
-        // console.log(coinData);
-        const resource = coinData.resources.filter(resource => resource._id.toString() === req.params.resourceId);
-        console.log(resource);
-        return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'forms', 'update_resource.ejs'), 
-            { 
-                group: req.params.group, 
-                coin: req.params.coin, 
-                resource: resource[0].resource, 
-                imageLink: resource[0].imageLink, 
-                hyperlink: resource[0].hyperlink,
-                resourceId: resource[0]._id
-            });
-    } catch (error) {
-        next(error);
-    }
-}
+const getUpdateResourceForm = async (req, res, next) => {}
 
 const groupsController = { getAddGroupForm, getUpdateGroupForm, getAddCoinForm, getUpdateCoinForm, getAddResourceForm, getUpdateResourceForm };
killedBy: Get Admin Forms Resource Form Update Resource Form - renders form with expected arguments
statusReason: expected false to be true

[Killed] BlockStatement
controllers/admin/forms.js:85:9
 }
 
 const getUpdateResourceForm = async (req, res, next) => {
-    try {
-        const coinData = await Coins.findOne({ coin: req.params.coin });
-        // console.log(coinData);
-        const resource = coinData.resources.filter(resource => resource._id.toString() === req.params.resourceId);
-        console.log(resource);
-        return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'forms', 'update_resource.ejs'), 
-            { 
-                group: req.params.group, 
-                coin: req.params.coin, 
-                resource: resource[0].resource, 
-                imageLink: resource[0].imageLink, 
-                hyperlink: resource[0].hyperlink,
-                resourceId: resource[0]._id
-            });
-    } catch (error) {
+    try {} catch (error) {
         next(error);
     }
killedBy: Get Admin Forms Resource Form Update Resource Form - renders form with expected arguments
statusReason: expected false to be true

[Killed] ArrowFunction
controllers/admin/forms.js:88:52
     try {
         const coinData = await Coins.findOne({ coin: req.params.coin });
         // console.log(coinData);
-        const resource = coinData.resources.filter(resource => resource._id.toString() === req.params.resourceId);
+        const resource = coinData.resources.filter(() => undefined);
         console.log(resource);
         return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'forms', 'update_resource.ejs'), 
killedBy: Get Admin Forms Resource Form Update Resource Form - renders form with expected arguments
statusReason: next is not a function

[Killed] EqualityOperator
controllers/admin/forms.js:88:64
     try {
         const coinData = await Coins.findOne({ coin: req.params.coin });
         // console.log(coinData);
-        const resource = coinData.resources.filter(resource => resource._id.toString() === req.params.resourceId);
+        const resource = coinData.resources.filter(resource => resource._id.toString() !== req.params.resourceId);
         console.log(resource);
         return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'forms', 'update_resource.ejs'), 
killedBy: Get Admin Forms Resource Form Update Resource Form - renders form with expected arguments
statusReason: next is not a function

[Killed] StringLiteral
controllers/admin/forms.js:90:60
         // console.log(coinData);
         const resource = coinData.resources.filter(resource => resource._id.toString() === req.params.resourceId);
         console.log(resource);
-        return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'forms', 'update_resource.ejs'), 
+        return res.render(path.join(__dirname, '..', '..', "", 'admin', 'forms', 'update_resource.ejs'), 
             { 
                 group: req.params.group, 
killedBy: Get Admin Forms Resource Form Update Resource Form - renders form with expected arguments
statusReason: expected false to be true

[Killed] StringLiteral
controllers/admin/forms.js:90:48
         // console.log(coinData);
         const resource = coinData.resources.filter(resource => resource._id.toString() === req.params.resourceId);
         console.log(resource);
-        return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'forms', 'update_resource.ejs'), 
+        return res.render(path.join(__dirname, "", '..', 'views', 'admin', 'forms', 'update_resource.ejs'), 
             { 
                 group: req.params.group, 
killedBy: Get Admin Forms Resource Form Update Resource Form - renders form with expected arguments
statusReason: expected false to be true
