[Killed] BlockStatement
controllers/auth.js:17:39
 
 const mailjet = Mailjet.apiConnect(process.env.API_KEY, process.env.API_SECRET);
 
-const getRegisterForm = (req, res) => {
-    return res.render(path.join(__dirname, '..', 'views', 'auth', 'register.ejs'), 
-        { 
-            errorMessage: req.flash('error')[0],
-            oldInput: req.session.oldInput || {}
-        });
-}
+const getRegisterForm = (req, res) => {}
 
 const postRegisterForm = async (req, res, next) => {
killedBy: authController getRegisterForm should render the registration form with expected variables
statusReason: expected false to be true

[Killed] StringLiteral
controllers/auth.js:18:67
 const mailjet = Mailjet.apiConnect(process.env.API_KEY, process.env.API_SECRET);
 
 const getRegisterForm = (req, res) => {
-    return res.render(path.join(__dirname, '..', 'views', 'auth', 'register.ejs'), 
+    return res.render(path.join(__dirname, '..', 'views', 'auth', ""), 
         { 
             errorMessage: req.flash('error')[0],
killedBy: authController getRegisterForm should render the registration form with expected variables
statusReason: expected 'C:\Users\GIF\OneDrive\Desktop\tls_cry…' to equal 'C:\Users\GIF\OneDrive\Desktop\tls_cry…'

[Killed] Regex
controllers/auth.js:31:30
         const user = await Users.findOne({ username: req.body.username });
         const { username, password, confirmedPassword } = req.body;
 
-        const emailPattern = /^[a-zA-Z0-9._-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,6}$/;
+        const emailPattern = /^[^a-zA-Z0-9._-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,6}$/;
 
         if (!emailPattern.test(username)) {
killedBy: authController postRegisterForm should create a new user and redirect to /login on successful registration
statusReason: expected false to be true

[Killed] Regex
controllers/auth.js:31:30
         const user = await Users.findOne({ username: req.body.username });
         const { username, password, confirmedPassword } = req.body;
 
-        const emailPattern = /^[a-zA-Z0-9._-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,6}$/;
+        const emailPattern = /^[a-zA-Z0-9._-]@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,6}$/;
 
         if (!emailPattern.test(username)) {
killedBy: authController postRegisterForm should create a new user and redirect to /login on successful registration
statusReason: expected false to be true

[Killed] BooleanLiteral
controllers/auth.js:33:13
 
         const emailPattern = /^[a-zA-Z0-9._-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,6}$/;
 
-        if (!emailPattern.test(username)) {
+        if (emailPattern.test(username)) {
             req.flash('error', 'Your username must be a valid email.');
             return res.redirect('/register');
killedBy: authController postRegisterForm should redirect to /register with an error if username is not a valid email
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/auth.js:33:13
 
         const emailPattern = /^[a-zA-Z0-9._-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,6}$/;
 
-        if (!emailPattern.test(username)) {
+        if (true) {
             req.flash('error', 'Your username must be a valid email.');
             return res.redirect('/register');
killedBy: authController postRegisterForm should create a new user and redirect to /login on successful registration
statusReason: expected false to be true

[Killed] StringLiteral
controllers/auth.js:34:23
         const emailPattern = /^[a-zA-Z0-9._-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,6}$/;
 
         if (!emailPattern.test(username)) {
-            req.flash('error', 'Your username must be a valid email.');
+            req.flash("", 'Your username must be a valid email.');
             return res.redirect('/register');
         }
killedBy: authController postRegisterForm should redirect to /register with an error if username is not a valid email
statusReason: expected false to be true

[Killed] BlockStatement
controllers/auth.js:38:20
             return res.redirect('/register');
         }
 
-        if (!user) {
-
-            // password conditions
-            const passwordMinimumLength = password.length < 8; 
-            const passwordCriteria = !/^(?=.*[A-Za-z])(?=.*\d)[A-Za-z\d.@!?]{8,}$/.test(password);
-
-            if (passwordMinimumLength || passwordCriteria) {
-                req.flash('error', `Your password must be at least 8 characters long and contains at least 1 alphabet and 1 number. Only special characters '.', '@', '!' and '?' are allowed.`);
-                req.session.oldInput = { username };
-                return req.session.save(error => error ? next(error) : res.redirect('/register'));
-            }
-            if (password !== confirmedPassword) {
-                req.flash('error', 'Passwords do not match.');
-                req.session.oldInput = { username };
-                return req.session.save(error => error ? next(error) : res.redirect('/register'));
-            }
-            const hashedPassword = await bcrypt.hash(password, 10);
-            await Users.create({ username, password: hashedPassword });
-            req.flash('success', 'New User created!');
-            return req.session.destroy(error => error ? next(error) : res.redirect('/login'));
-        } else {
+        if (!user) {} else {
             req.flash('error', 'This username is already registered. Please login.');
             req.session.oldInput = { username };
killedBy: authController postRegisterForm should redirect to /register with an error if password does not meet criteria
statusReason: expected false to be true

[Killed] EqualityOperator
controllers/auth.js:41:43
         if (!user) {
 
             // password conditions
-            const passwordMinimumLength = password.length < 8; 
+            const passwordMinimumLength = password.length >= 8; 
             const passwordCriteria = !/^(?=.*[A-Za-z])(?=.*\d)[A-Za-z\d.@!?]{8,}$/.test(password);
 
killedBy: authController postRegisterForm should create a new user and redirect to /login on successful registration
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/auth.js:41:43
         if (!user) {
 
             // password conditions
-            const passwordMinimumLength = password.length < 8; 
+            const passwordMinimumLength = true; 
             const passwordCriteria = !/^(?=.*[A-Za-z])(?=.*\d)[A-Za-z\d.@!?]{8,}$/.test(password);
 
killedBy: authController postRegisterForm should create a new user and redirect to /login on successful registration
statusReason: expected false to be true

[Killed] BooleanLiteral
controllers/auth.js:42:38
 
             // password conditions
             const passwordMinimumLength = password.length < 8; 
-            const passwordCriteria = !/^(?=.*[A-Za-z])(?=.*\d)[A-Za-z\d.@!?]{8,}$/.test(password);
+            const passwordCriteria = /^(?=.*[A-Za-z])(?=.*\d)[A-Za-z\d.@!?]{8,}$/.test(password);
 
             if (passwordMinimumLength || passwordCriteria) {
killedBy: authController postRegisterForm should create a new user and redirect to /login on successful registration
statusReason: expected false to be true

[Killed] Regex
controllers/auth.js:42:39
 
             // password conditions
             const passwordMinimumLength = password.length < 8; 
-            const passwordCriteria = !/^(?=.*[A-Za-z])(?=.*\d)[A-Za-z\d.@!?]{8,}$/.test(password);
+            const passwordCriteria = !/^(?=.*[A-Za-z])(?!.*\d)[A-Za-z\d.@!?]{8,}$/.test(password);
 
             if (passwordMinimumLength || passwordCriteria) {
killedBy: authController postRegisterForm should create a new user and redirect to /login on successful registration
statusReason: expected false to be true

[Killed] BlockStatement
controllers/auth.js:44:60
             const passwordMinimumLength = password.length < 8; 
             const passwordCriteria = !/^(?=.*[A-Za-z])(?=.*\d)[A-Za-z\d.@!?]{8,}$/.test(password);
 
-            if (passwordMinimumLength || passwordCriteria) {
-                req.flash('error', `Your password must be at least 8 characters long and contains at least 1 alphabet and 1 number. Only special characters '.', '@', '!' and '?' are allowed.`);
-                req.session.oldInput = { username };
-                return req.session.save(error => error ? next(error) : res.redirect('/register'));
-            }
+            if (passwordMinimumLength || passwordCriteria) {}
             if (password !== confirmedPassword) {
                 req.flash('error', 'Passwords do not match.');
killedBy: authController postRegisterForm should redirect to /register with an error if password does not meet criteria
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/auth.js:44:17
             const passwordMinimumLength = password.length < 8; 
             const passwordCriteria = !/^(?=.*[A-Za-z])(?=.*\d)[A-Za-z\d.@!?]{8,}$/.test(password);
 
-            if (passwordMinimumLength || passwordCriteria) {
+            if (false) {
                 req.flash('error', `Your password must be at least 8 characters long and contains at least 1 alphabet and 1 number. Only special characters '.', '@', '!' and '?' are allowed.`);
                 req.session.oldInput = { username };
killedBy: authController postRegisterForm should redirect to /register with an error if password does not meet criteria
statusReason: expected false to be true

[Survived] StringLiteral
controllers/auth.js:45:36
             const passwordCriteria = !/^(?=.*[A-Za-z])(?=.*\d)[A-Za-z\d.@!?]{8,}$/.test(password);
 
             if (passwordMinimumLength || passwordCriteria) {
-                req.flash('error', `Your password must be at least 8 characters long and contains at least 1 alphabet and 1 number. Only special characters '.', '@', '!' and '?' are allowed.`);
+                req.flash('error', ``);
                 req.session.oldInput = { username };
                 return req.session.save(error => error ? next(error) : res.redirect('/register'));

[Killed] ArrowFunction
controllers/auth.js:47:41
             if (passwordMinimumLength || passwordCriteria) {
                 req.flash('error', `Your password must be at least 8 characters long and contains at least 1 alphabet and 1 number. Only special characters '.', '@', '!' and '?' are allowed.`);
                 req.session.oldInput = { username };
-                return req.session.save(error => error ? next(error) : res.redirect('/register'));
+                return req.session.save(() => undefined);
             }
             if (password !== confirmedPassword) {
killedBy: authController postRegisterForm should redirect to /register with an error if password does not meet criteria
statusReason: expected false to be true

[Killed] EqualityOperator
controllers/auth.js:49:17
                 req.session.oldInput = { username };
                 return req.session.save(error => error ? next(error) : res.redirect('/register'));
             }
-            if (password !== confirmedPassword) {
+            if (password === confirmedPassword) {
                 req.flash('error', 'Passwords do not match.');
                 req.session.oldInput = { username };
killedBy: authController postRegisterForm should redirect to /register with an error if passwords do not match
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/auth.js:49:17
                 req.session.oldInput = { username };
                 return req.session.save(error => error ? next(error) : res.redirect('/register'));
             }
-            if (password !== confirmedPassword) {
+            if (true) {
                 req.flash('error', 'Passwords do not match.');
                 req.session.oldInput = { username };
killedBy: authController postRegisterForm should create a new user and redirect to /login on successful registration
statusReason: expected false to be true

[Survived] StringLiteral
controllers/auth.js:50:36
                 return req.session.save(error => error ? next(error) : res.redirect('/register'));
             }
             if (password !== confirmedPassword) {
-                req.flash('error', 'Passwords do not match.');
+                req.flash('error', "");
                 req.session.oldInput = { username };
                 return req.session.save(error => error ? next(error) : res.redirect('/register'));

[Killed] StringLiteral
controllers/auth.js:52:85
             if (password !== confirmedPassword) {
                 req.flash('error', 'Passwords do not match.');
                 req.session.oldInput = { username };
-                return req.session.save(error => error ? next(error) : res.redirect('/register'));
+                return req.session.save(error => error ? next(error) : res.redirect(""));
             }
             const hashedPassword = await bcrypt.hash(password, 10);
killedBy: authController postRegisterForm should redirect to /register with an error if passwords do not match
statusReason: expected false to be true

[Survived] StringLiteral
controllers/auth.js:56:34
             }
             const hashedPassword = await bcrypt.hash(password, 10);
             await Users.create({ username, password: hashedPassword });
-            req.flash('success', 'New User created!');
+            req.flash('success', "");
             return req.session.destroy(error => error ? next(error) : res.redirect('/login'));
         } else {

[Killed] ArrowFunction
controllers/auth.js:57:40
             const hashedPassword = await bcrypt.hash(password, 10);
             await Users.create({ username, password: hashedPassword });
             req.flash('success', 'New User created!');
-            return req.session.destroy(error => error ? next(error) : res.redirect('/login'));
+            return req.session.destroy(() => undefined);
         } else {
             req.flash('error', 'This username is already registered. Please login.');
killedBy: authController postRegisterForm should create a new user and redirect to /login on successful registration
statusReason: expected false to be true

[Killed] BlockStatement
controllers/auth.js:58:16
             await Users.create({ username, password: hashedPassword });
             req.flash('success', 'New User created!');
             return req.session.destroy(error => error ? next(error) : res.redirect('/login'));
-        } else {
-            req.flash('error', 'This username is already registered. Please login.');
-            req.session.oldInput = { username };
-            return req.session.save(error => error ? next(error) : res.redirect('/register'));
-        }
+        } else {}
 
     } catch(error) {
killedBy: authController postRegisterForm should redirect to /register with an error if username is already registered
statusReason: expected false to be true

[Killed] StringLiteral
controllers/auth.js:59:23
             req.flash('success', 'New User created!');
             return req.session.destroy(error => error ? next(error) : res.redirect('/login'));
         } else {
-            req.flash('error', 'This username is already registered. Please login.');
+            req.flash("", 'This username is already registered. Please login.');
             req.session.oldInput = { username };
             return req.session.save(error => error ? next(error) : res.redirect('/register'));
killedBy: authController postRegisterForm should redirect to /register with an error if username is already registered
statusReason: expected false to be true

[Survived] StringLiteral
controllers/auth.js:59:32
             req.flash('success', 'New User created!');
             return req.session.destroy(error => error ? next(error) : res.redirect('/login'));
         } else {
-            req.flash('error', 'This username is already registered. Please login.');
+            req.flash('error', "");
             req.session.oldInput = { username };
             return req.session.save(error => error ? next(error) : res.redirect('/register'));

[Killed] BlockStatement
controllers/auth.js:64:20
             return req.session.save(error => error ? next(error) : res.redirect('/register'));
         }
 
-    } catch(error) {
-        next(error);
-    }
+    } catch(error) {}
 }
 
killedBy: authController postRegisterForm should call next with an error if there is a problem during registration
statusReason: expected false to be true

[Killed] BlockStatement
controllers/auth.js:69:36
     }
 }
 
-const getLoginForm = (req, res) => {
-    return res.render(path.join(__dirname, '..', 'views', 'auth', 'login.ejs'), 
-        { 
-            successMessage: req.flash('success')[0], 
-            errorMessage: req.flash('error')[0],
-            oldInput: req.session.oldInput || {}
-        });
-}
+const getLoginForm = (req, res) => {}
 
 const postLoginForm = async (req, res, next) => {
killedBy: authController getLoginForm should render the login view with messages and old input
statusReason: expected false to be true

[Killed] StringLiteral
controllers/auth.js:70:44
 }
 
 const getLoginForm = (req, res) => {
-    return res.render(path.join(__dirname, '..', 'views', 'auth', 'login.ejs'), 
+    return res.render(path.join(__dirname, "", 'views', 'auth', 'login.ejs'), 
         { 
             successMessage: req.flash('success')[0], 
killedBy: authController getLoginForm should render the login view with messages and old input
statusReason: expected 'C:\Users\GIF\OneDrive\Desktop\tls_cry…' to equal 'C:\Users\GIF\OneDrive\Desktop\tls_cry…'

[Killed] ObjectLiteral
controllers/auth.js:71:9
 
 const getLoginForm = (req, res) => {
     return res.render(path.join(__dirname, '..', 'views', 'auth', 'login.ejs'), 
-        { 
-            successMessage: req.flash('success')[0], 
-            errorMessage: req.flash('error')[0],
-            oldInput: req.session.oldInput || {}
-        });
+        {});
 }
 
killedBy: authController getLoginForm should render the login view with messages and old input
statusReason: expected {} to deeply equal { …(3) }

[Killed] BlockStatement
controllers/auth.js:80:9
 
 const postLoginForm = async (req, res, next) => {
     
-    try {
-        const user = await Users.findOne({ username: req.body.username });
-
-        if (user === null) {
-            req.flash('error', 'No username exists. Please register a new account.');
-            return res.redirect('/login');
-        }
-
-        const isPasswordCorrect = await bcrypt.compare(req.body.password, user.password);
-        
-        if (isPasswordCorrect) {
-            req.session.isLoggedIn = true;
-            req.session.user = user;
-            return req.session.save(error => error ? next(error) : res.redirect(`/admin`));
-        } else {
-            req.flash('error', 'Invalid password!');
-            req.session.oldInput = { username: req.body.username };
-            return req.session.save(error => error ? next(error) : res.redirect('/login'));
-        }   
-
-    } catch (error) {
+    try {} catch (error) {
         next(error);
     }
killedBy: authController postLoginForm should redirect to /login with an error if no user exists
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/auth.js:83:13
     try {
         const user = await Users.findOne({ username: req.body.username });
 
-        if (user === null) {
+        if (true) {
             req.flash('error', 'No username exists. Please register a new account.');
             return res.redirect('/login');
killedBy: authController postLoginForm should redirect to /admin if password is correct
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/auth.js:83:13
     try {
         const user = await Users.findOne({ username: req.body.username });
 
-        if (user === null) {
+        if (false) {
             req.flash('error', 'No username exists. Please register a new account.');
             return res.redirect('/login');
killedBy: authController postLoginForm should redirect to /login with an error if no user exists
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/auth.js:90:13
 
         const isPasswordCorrect = await bcrypt.compare(req.body.password, user.password);
         
-        if (isPasswordCorrect) {
+        if (false) {
             req.session.isLoggedIn = true;
             req.session.user = user;
killedBy: authController postLoginForm should redirect to /admin if password is correct
statusReason: expected undefined to be true

[Killed] BlockStatement
controllers/auth.js:90:32
 
         const isPasswordCorrect = await bcrypt.compare(req.body.password, user.password);
         
-        if (isPasswordCorrect) {
-            req.session.isLoggedIn = true;
-            req.session.user = user;
-            return req.session.save(error => error ? next(error) : res.redirect(`/admin`));
-        } else {
+        if (isPasswordCorrect) {} else {
             req.flash('error', 'Invalid password!');
             req.session.oldInput = { username: req.body.username };
killedBy: authController postLoginForm should redirect to /admin if password is correct
statusReason: expected undefined to be true

[Killed] BooleanLiteral
controllers/auth.js:91:38
         const isPasswordCorrect = await bcrypt.compare(req.body.password, user.password);
         
         if (isPasswordCorrect) {
-            req.session.isLoggedIn = true;
+            req.session.isLoggedIn = false;
             req.session.user = user;
             return req.session.save(error => error ? next(error) : res.redirect(`/admin`));
killedBy: authController postLoginForm should redirect to /admin if password is correct
statusReason: expected false to be true

[Killed] ArrowFunction
controllers/auth.js:93:37
         if (isPasswordCorrect) {
             req.session.isLoggedIn = true;
             req.session.user = user;
-            return req.session.save(error => error ? next(error) : res.redirect(`/admin`));
+            return req.session.save(() => undefined);
         } else {
             req.flash('error', 'Invalid password!');
killedBy: authController postLoginForm should redirect to /admin if password is correct
statusReason: expected false to be true

[Killed] BlockStatement
controllers/auth.js:94:16
             req.session.isLoggedIn = true;
             req.session.user = user;
             return req.session.save(error => error ? next(error) : res.redirect(`/admin`));
-        } else {
-            req.flash('error', 'Invalid password!');
-            req.session.oldInput = { username: req.body.username };
-            return req.session.save(error => error ? next(error) : res.redirect('/login'));
-        }   
+        } else {}   
 
     } catch (error) {
killedBy: authController postLoginForm should redirect to /login with an error if password is incorrect
statusReason: expected false to be true

[Killed] ArrowFunction
controllers/auth.js:97:37
         } else {
             req.flash('error', 'Invalid password!');
             req.session.oldInput = { username: req.body.username };
-            return req.session.save(error => error ? next(error) : res.redirect('/login'));
+            return req.session.save(() => undefined);
         }   
 
killedBy: authController postLoginForm should redirect to /login with an error if password is incorrect
statusReason: expected false to be true

[Killed] BlockStatement
controllers/auth.js:105:40
     }
 }
 
-const postLogout = (req, res, next) => {
-    return req.session.destroy(error => error ? next(error) : res.redirect('/'));
-}
+const postLogout = (req, res, next) => {}
 
 const getPasswordResetForm = (req, res) => {
killedBy: authController postLogout should destroy the session and redirect to the home page
statusReason: expected false to be true

[Killed] ArrowFunction
controllers/auth.js:106:32
 }
 
 const postLogout = (req, res, next) => {
-    return req.session.destroy(error => error ? next(error) : res.redirect('/'));
+    return req.session.destroy(() => undefined);
 }
 
killedBy: authController postLogout should destroy the session and redirect to the home page
statusReason: expected false to be true

[Killed] BlockStatement
controllers/auth.js:109:44
     return req.session.destroy(error => error ? next(error) : res.redirect('/'));
 }
 
-const getPasswordResetForm = (req, res) => {
-    return res.render(path.join(__dirname, '..', 'views', 'auth', 'forgot_password.ejs'), 
-        {
-            successMessage: req.flash('success')[0],
-            errorMessage: req.flash('error')[0],
-        });
-}
+const getPasswordResetForm = (req, res) => {}
 
 const postPasswordResetForm = async (req, res, next) => {
killedBy: authController getPasswordResetForm should render the forgot_password template with success and error messages
statusReason: expected false to be true

[Killed] StringLiteral
controllers/auth.js:110:50
 }
 
 const getPasswordResetForm = (req, res) => {
-    return res.render(path.join(__dirname, '..', 'views', 'auth', 'forgot_password.ejs'), 
+    return res.render(path.join(__dirname, '..', "", 'auth', 'forgot_password.ejs'), 
         {
             successMessage: req.flash('success')[0],
killedBy: authController getPasswordResetForm should render the forgot_password template with success and error messages
statusReason: expected false to be true

[NoCoverage] StringLiteral
controllers/auth.js:125:64
         if (user === null) {
             req.flash('error', 'This username doesn\'t exist.');
         } else {
-            const resetToken = crypto.randomBytes(20).toString('hex');
+            const resetToken = crypto.randomBytes(20).toString("");
             user.resetToken = resetToken;
             const tokenExpiration = Date.now() + 3600000; // expires 1 hour from now;

[NoCoverage] ArithmeticOperator
controllers/auth.js:127:37
         } else {
             const resetToken = crypto.randomBytes(20).toString('hex');
             user.resetToken = resetToken;
-            const tokenExpiration = Date.now() + 3600000; // expires 1 hour from now;
+            const tokenExpiration = Date.now() - 3600000; // expires 1 hour from now;
             user.tokenExpiration = tokenExpiration;
 

[NoCoverage] StringLiteral
controllers/auth.js:131:44
             user.tokenExpiration = tokenExpiration;
 
             mailjet
-                .post('send', { 'version': 'v3.1' })
+                .post('send', { 'version': "" })
                 .request({
                     Messages: [

[NoCoverage] ObjectLiteral
controllers/auth.js:131:31
             user.tokenExpiration = tokenExpiration;
 
             mailjet
-                .post('send', { 'version': 'v3.1' })
+                .post('send', {})
                 .request({
                     Messages: [

[NoCoverage] ObjectLiteral
controllers/auth.js:132:26
 
             mailjet
                 .post('send', { 'version': 'v3.1' })
-                .request({
-                    Messages: [
-                        {
-                            From: {
-                                Email: process.env.SENDER_EMAIL,
-                                Name: 'Support'
-                            },
-                            To: [
-                                {
-                                    Email: req.body.username,
-                                    Name: 'User'
-                                }
-                            ],
-                            Subject: 'Resetting your password',
-                            HTMLPart: `
-                                <p>You requested a password reset.</p>
-                                <p>Click <a href="${process.env.HOME_URL}/reset/${resetToken}">here</a> to set a new password.</p>
-                                `
-                        }
-                    ]
-                })
+                .request({})
                 .then(result => console.log(result.body.Messages))
                 .catch(error => console.log(error.statusCode));

[NoCoverage] ObjectLiteral
controllers/auth.js:135:35
                 .request({
                     Messages: [
                         {
-                            From: {
-                                Email: process.env.SENDER_EMAIL,
-                                Name: 'Support'
-                            },
+                            From: {},
                             To: [
                                 {

[NoCoverage] StringLiteral
controllers/auth.js:137:39
                         {
                             From: {
                                 Email: process.env.SENDER_EMAIL,
-                                Name: 'Support'
+                                Name: ""
                             },
                             To: [

[NoCoverage] ArrowFunction
controllers/auth.js:153:23
                         }
                     ]
                 })
-                .then(result => console.log(result.body.Messages))
+                .then(() => undefined)
                 .catch(error => console.log(error.statusCode));
 

[NoCoverage] ArrowFunction
controllers/auth.js:154:24
                     ]
                 })
                 .then(result => console.log(result.body.Messages))
-                .catch(error => console.log(error.statusCode));
+                .catch(() => undefined);
 
             req.flash('success', 'We have emailed you a new password. Please check your inbox.');
