[NoCoverage] BlockStatement
controllers/auth.js:166:54
     }
 }
 
-const getNewPasswordForm = async (req, res, next) => {
-    const token = req.params.token;
-    const user = await Users.findOne({ resetToken: token, tokenExpiration: { $gt: Date.now() } });
-    
-    try {
-        if (user === null) {
-            return res.render(path.join(__dirname, '..', 'views', '404.ejs'));
-        } else {
-            return res.render(path.join(__dirname, '..', 'views', 'auth', 'new_password.ejs'), 
-                {
-                    userId: user._id.toString(),
-                    errorMessage: req.flash('error')[0],
-                    passwordToken: token,
-                });
-        }
-    } catch (error) {
-        next(next);
-    }
-}
+const getNewPasswordForm = async (req, res, next) => {}
 
 const postNewPasswordForm = async (req, res, next) => {

[NoCoverage] ObjectLiteral
controllers/auth.js:168:38
 
 const getNewPasswordForm = async (req, res, next) => {
     const token = req.params.token;
-    const user = await Users.findOne({ resetToken: token, tokenExpiration: { $gt: Date.now() } });
+    const user = await Users.findOne({});
     
     try {

[NoCoverage] BlockStatement
controllers/auth.js:170:9
     const token = req.params.token;
     const user = await Users.findOne({ resetToken: token, tokenExpiration: { $gt: Date.now() } });
     
-    try {
-        if (user === null) {
-            return res.render(path.join(__dirname, '..', 'views', '404.ejs'));
-        } else {
-            return res.render(path.join(__dirname, '..', 'views', 'auth', 'new_password.ejs'), 
-                {
-                    userId: user._id.toString(),
-                    errorMessage: req.flash('error')[0],
-                    passwordToken: token,
-                });
-        }
-    } catch (error) {
+    try {} catch (error) {
         next(next);
     }

[NoCoverage] BlockStatement
controllers/auth.js:171:28
     const user = await Users.findOne({ resetToken: token, tokenExpiration: { $gt: Date.now() } });
     
     try {
-        if (user === null) {
-            return res.render(path.join(__dirname, '..', 'views', '404.ejs'));
-        } else {
+        if (user === null) {} else {
             return res.render(path.join(__dirname, '..', 'views', 'auth', 'new_password.ejs'), 
                 {

[NoCoverage] ConditionalExpression
controllers/auth.js:171:13
     const user = await Users.findOne({ resetToken: token, tokenExpiration: { $gt: Date.now() } });
     
     try {
-        if (user === null) {
+        if (false) {
             return res.render(path.join(__dirname, '..', 'views', '404.ejs'));
         } else {

[NoCoverage] StringLiteral
controllers/auth.js:172:58
     
     try {
         if (user === null) {
-            return res.render(path.join(__dirname, '..', 'views', '404.ejs'));
+            return res.render(path.join(__dirname, '..', "", '404.ejs'));
         } else {
             return res.render(path.join(__dirname, '..', 'views', 'auth', 'new_password.ejs'), 

[NoCoverage] BlockStatement
controllers/auth.js:173:16
     try {
         if (user === null) {
             return res.render(path.join(__dirname, '..', 'views', '404.ejs'));
-        } else {
-            return res.render(path.join(__dirname, '..', 'views', 'auth', 'new_password.ejs'), 
-                {
-                    userId: user._id.toString(),
-                    errorMessage: req.flash('error')[0],
-                    passwordToken: token,
-                });
-        }
+        } else {}
     } catch (error) {
         next(next);

[NoCoverage] StringLiteral
controllers/auth.js:177:45
             return res.render(path.join(__dirname, '..', 'views', 'auth', 'new_password.ejs'), 
                 {
                     userId: user._id.toString(),
-                    errorMessage: req.flash('error')[0],
+                    errorMessage: req.flash("")[0],
                     passwordToken: token,
                 });

[NoCoverage] BlockStatement
controllers/auth.js:181:21
                     passwordToken: token,
                 });
         }
-    } catch (error) {
-        next(next);
-    }
+    } catch (error) {}
 }
 

[Killed] BlockStatement
controllers/auth.js:190:9
 
     const { newPassword, confirmedNewPassword, passwordToken, userId } = req.body;
 
-    try {
-        // password conditions
-        const passwordMinimumLength = newPassword.length < 8; 
-        const passwordCriteria = !/^(?=.*[A-Za-z])(?=.*\d)[A-Za-z\d.@!?]{8,}$/.test(newPassword);
-        
-        if (passwordMinimumLength || passwordCriteria) {
-            req.flash('error', `Your password must be at least 8 characters long and contains at least 1 alphabet and 1 number. Only special characters '.', '@', '!' and '?' are allowed.`);
-            return req.session.save(error => error ? next(error) : res.redirect(`/reset/${passwordToken}`));
-        }
-        if (newPassword !== confirmedNewPassword) {
-            req.flash('error', 'Passwords do not match.');
-            return req.session.save(error => error ? next(error) : res.redirect(`/reset/${passwordToken}`));
-        } else {
-            const user = await Users.findOne({ resetToken: passwordToken, tokenExpiration: { $gt: Date.now() }, _id: userId  });
-            const hashedPassword = await bcrypt.hash(newPassword, 10);
-            user.password = hashedPassword;
-            user.resetToken = undefined;
-            user.tokenExpiration = undefined;
-            user.save();
-            return res.redirect('/login');
-        }
-    } catch (error) {
+    try {} catch (error) {
         next(error);
     }
killedBy: authController postNewPasswordForm should redirect to login after successfully updating password
statusReason: expected false to be true

[Killed] EqualityOperator
controllers/auth.js:192:39
 
     try {
         // password conditions
-        const passwordMinimumLength = newPassword.length < 8; 
+        const passwordMinimumLength = newPassword.length >= 8; 
         const passwordCriteria = !/^(?=.*[A-Za-z])(?=.*\d)[A-Za-z\d.@!?]{8,}$/.test(newPassword);
         
killedBy: authController postNewPasswordForm should redirect to login after successfully updating password
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/auth.js:192:39
 
     try {
         // password conditions
-        const passwordMinimumLength = newPassword.length < 8; 
+        const passwordMinimumLength = true; 
         const passwordCriteria = !/^(?=.*[A-Za-z])(?=.*\d)[A-Za-z\d.@!?]{8,}$/.test(newPassword);
         
killedBy: authController postNewPasswordForm should redirect to login after successfully updating password
statusReason: expected false to be true

[Killed] BooleanLiteral
controllers/auth.js:193:34
     try {
         // password conditions
         const passwordMinimumLength = newPassword.length < 8; 
-        const passwordCriteria = !/^(?=.*[A-Za-z])(?=.*\d)[A-Za-z\d.@!?]{8,}$/.test(newPassword);
+        const passwordCriteria = /^(?=.*[A-Za-z])(?=.*\d)[A-Za-z\d.@!?]{8,}$/.test(newPassword);
         
         if (passwordMinimumLength || passwordCriteria) {
killedBy: authController postNewPasswordForm should redirect to login after successfully updating password
statusReason: expected false to be true

[Killed] Regex
controllers/auth.js:193:35
     try {
         // password conditions
         const passwordMinimumLength = newPassword.length < 8; 
-        const passwordCriteria = !/^(?=.*[A-Za-z])(?=.*\d)[A-Za-z\d.@!?]{8,}$/.test(newPassword);
+        const passwordCriteria = !/^(?=.*[A-Za-z])(?=.*\d)[^A-Za-z\d.@!?]{8,}$/.test(newPassword);
         
         if (passwordMinimumLength || passwordCriteria) {
killedBy: authController postNewPasswordForm should redirect to login after successfully updating password
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/auth.js:195:13
         const passwordMinimumLength = newPassword.length < 8; 
         const passwordCriteria = !/^(?=.*[A-Za-z])(?=.*\d)[A-Za-z\d.@!?]{8,}$/.test(newPassword);
         
-        if (passwordMinimumLength || passwordCriteria) {
+        if (true) {
             req.flash('error', `Your password must be at least 8 characters long and contains at least 1 alphabet and 1 number. Only special characters '.', '@', '!' and '?' are allowed.`);
             return req.session.save(error => error ? next(error) : res.redirect(`/reset/${passwordToken}`));
killedBy: authController postNewPasswordForm should redirect to login after successfully updating password
statusReason: expected false to be true

[Survived] LogicalOperator
controllers/auth.js:195:13
         const passwordMinimumLength = newPassword.length < 8; 
         const passwordCriteria = !/^(?=.*[A-Za-z])(?=.*\d)[A-Za-z\d.@!?]{8,}$/.test(newPassword);
         
-        if (passwordMinimumLength || passwordCriteria) {
+        if (passwordMinimumLength && passwordCriteria) {
             req.flash('error', `Your password must be at least 8 characters long and contains at least 1 alphabet and 1 number. Only special characters '.', '@', '!' and '?' are allowed.`);
             return req.session.save(error => error ? next(error) : res.redirect(`/reset/${passwordToken}`));

[Killed] ArrowFunction
controllers/auth.js:197:37
         
         if (passwordMinimumLength || passwordCriteria) {
             req.flash('error', `Your password must be at least 8 characters long and contains at least 1 alphabet and 1 number. Only special characters '.', '@', '!' and '?' are allowed.`);
-            return req.session.save(error => error ? next(error) : res.redirect(`/reset/${passwordToken}`));
+            return req.session.save(() => undefined);
         }
         if (newPassword !== confirmedNewPassword) {
killedBy: authController postNewPasswordForm should redirect to reset page with an error if password does not meet criteria
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/auth.js:199:13
             req.flash('error', `Your password must be at least 8 characters long and contains at least 1 alphabet and 1 number. Only special characters '.', '@', '!' and '?' are allowed.`);
             return req.session.save(error => error ? next(error) : res.redirect(`/reset/${passwordToken}`));
         }
-        if (newPassword !== confirmedNewPassword) {
+        if (false) {
             req.flash('error', 'Passwords do not match.');
             return req.session.save(error => error ? next(error) : res.redirect(`/reset/${passwordToken}`));
killedBy: authController postNewPasswordForm should redirect to reset page with an error if passwords do not match
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/auth.js:199:13
             req.flash('error', `Your password must be at least 8 characters long and contains at least 1 alphabet and 1 number. Only special characters '.', '@', '!' and '?' are allowed.`);
             return req.session.save(error => error ? next(error) : res.redirect(`/reset/${passwordToken}`));
         }
-        if (newPassword !== confirmedNewPassword) {
+        if (true) {
             req.flash('error', 'Passwords do not match.');
             return req.session.save(error => error ? next(error) : res.redirect(`/reset/${passwordToken}`));
killedBy: authController postNewPasswordForm should redirect to login after successfully updating password
statusReason: expected false to be true

[Killed] ArrowFunction
controllers/auth.js:201:37
         }
         if (newPassword !== confirmedNewPassword) {
             req.flash('error', 'Passwords do not match.');
-            return req.session.save(error => error ? next(error) : res.redirect(`/reset/${passwordToken}`));
+            return req.session.save(() => undefined);
         } else {
             const user = await Users.findOne({ resetToken: passwordToken, tokenExpiration: { $gt: Date.now() }, _id: userId  });
killedBy: authController postNewPasswordForm should redirect to reset page with an error if passwords do not match
statusReason: expected false to be true

[Killed] StringLiteral
controllers/auth.js:201:81
         }
         if (newPassword !== confirmedNewPassword) {
             req.flash('error', 'Passwords do not match.');
-            return req.session.save(error => error ? next(error) : res.redirect(`/reset/${passwordToken}`));
+            return req.session.save(error => error ? next(error) : res.redirect(``));
         } else {
             const user = await Users.findOne({ resetToken: passwordToken, tokenExpiration: { $gt: Date.now() }, _id: userId  });
killedBy: authController postNewPasswordForm should redirect to reset page with an error if passwords do not match
statusReason: expected false to be true

[Killed] BlockStatement
controllers/auth.js:202:16
         if (newPassword !== confirmedNewPassword) {
             req.flash('error', 'Passwords do not match.');
             return req.session.save(error => error ? next(error) : res.redirect(`/reset/${passwordToken}`));
-        } else {
-            const user = await Users.findOne({ resetToken: passwordToken, tokenExpiration: { $gt: Date.now() }, _id: userId  });
-            const hashedPassword = await bcrypt.hash(newPassword, 10);
-            user.password = hashedPassword;
-            user.resetToken = undefined;
-            user.tokenExpiration = undefined;
-            user.save();
-            return res.redirect('/login');
-        }
+        } else {}
     } catch (error) {
         next(error);
killedBy: authController postNewPasswordForm should redirect to login after successfully updating password
statusReason: expected false to be true

[Survived] ObjectLiteral
controllers/auth.js:203:92
             req.flash('error', 'Passwords do not match.');
             return req.session.save(error => error ? next(error) : res.redirect(`/reset/${passwordToken}`));
         } else {
-            const user = await Users.findOne({ resetToken: passwordToken, tokenExpiration: { $gt: Date.now() }, _id: userId  });
+            const user = await Users.findOne({ resetToken: passwordToken, tokenExpiration: {}, _id: userId  });
             const hashedPassword = await bcrypt.hash(newPassword, 10);
             user.password = hashedPassword;

[Survived] ObjectLiteral
controllers/auth.js:203:46
             req.flash('error', 'Passwords do not match.');
             return req.session.save(error => error ? next(error) : res.redirect(`/reset/${passwordToken}`));
         } else {
-            const user = await Users.findOne({ resetToken: passwordToken, tokenExpiration: { $gt: Date.now() }, _id: userId  });
+            const user = await Users.findOne({});
             const hashedPassword = await bcrypt.hash(newPassword, 10);
             user.password = hashedPassword;

[Killed] StringLiteral
controllers/auth.js:209:33
             user.resetToken = undefined;
             user.tokenExpiration = undefined;
             user.save();
-            return res.redirect('/login');
+            return res.redirect("");
         }
     } catch (error) {
killedBy: authController postNewPasswordForm should redirect to login after successfully updating password
statusReason: expected false to be true

[NoCoverage] BlockStatement
controllers/auth.js:211:21
             user.save();
             return res.redirect('/login');
         }
-    } catch (error) {
-        next(error);
-    }
+    } catch (error) {}
 }
 
