[Killed] BlockStatement
controllers/admin/pages.js:9:35
 const __dirname = path.dirname(__filename);
 
 
-const getMainPage = (req, res) => {
-    return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'pages', 'groups.ejs'));
-}
+const getMainPage = (req, res) => {}
 
 const getGroupPage = (req, res) => {
killedBy: Get Admin Pages getMainPage should render the main page
statusReason: expected false to be true

[Killed] StringLiteral
controllers/admin/pages.js:10:44
 
 
 const getMainPage = (req, res) => {
-    return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'pages', 'groups.ejs'));
+    return res.render(path.join(__dirname, "", '..', 'views', 'admin', 'pages', 'groups.ejs'));
 }
 
killedBy: Get Admin Pages getMainPage should render the main page
statusReason: expected false to be true

[Killed] StringLiteral
controllers/admin/pages.js:10:65
 
 
 const getMainPage = (req, res) => {
-    return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'pages', 'groups.ejs'));
+    return res.render(path.join(__dirname, '..', '..', 'views', "", 'pages', 'groups.ejs'));
 }
 
killedBy: Get Admin Pages getMainPage should render the main page
statusReason: expected false to be true

[Killed] BlockStatement
controllers/admin/pages.js:13:36
     return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'pages', 'groups.ejs'));
 }
 
-const getGroupPage = (req, res) => {
-    const { groups } = res.locals
-    const filteredGroups = groups.filter(group => group.group === req.params.group);
-    const noGroupFound = filteredGroups.length === 0
-
-    if (noGroupFound) {
-        return res.status(404).render(path.join(__dirname, '..', '..', 'views', '404.ejs'));
-    } else {
-        const { group, description, coins } = filteredGroups[0];
-        return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'pages', 'group.ejs'), { group, description, coins });
-    }
-};
+const getGroupPage = (req, res) => {};
 
 const getCoinPage = async (req, res, next) => {
killedBy: Get Admin Pages getGroupPage should render a 404 page if no group is found
statusReason: expected false to be true

[Killed] ArrowFunction
controllers/admin/pages.js:15:42
 
 const getGroupPage = (req, res) => {
     const { groups } = res.locals
-    const filteredGroups = groups.filter(group => group.group === req.params.group);
+    const filteredGroups = groups.filter(() => undefined);
     const noGroupFound = filteredGroups.length === 0
 
killedBy: Get Admin Pages getGroupPage should render the group page if the group is found
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/admin/pages.js:15:51
 
 const getGroupPage = (req, res) => {
     const { groups } = res.locals
-    const filteredGroups = groups.filter(group => group.group === req.params.group);
+    const filteredGroups = groups.filter(group => false);
     const noGroupFound = filteredGroups.length === 0
 
killedBy: Get Admin Pages getGroupPage should render the group page if the group is found
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/admin/pages.js:16:26
 const getGroupPage = (req, res) => {
     const { groups } = res.locals
     const filteredGroups = groups.filter(group => group.group === req.params.group);
-    const noGroupFound = filteredGroups.length === 0
+    const noGroupFound = true
 
     if (noGroupFound) {
killedBy: Get Admin Pages getGroupPage should render the group page if the group is found
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/admin/pages.js:16:26
 const getGroupPage = (req, res) => {
     const { groups } = res.locals
     const filteredGroups = groups.filter(group => group.group === req.params.group);
-    const noGroupFound = filteredGroups.length === 0
+    const noGroupFound = false
 
     if (noGroupFound) {
killedBy: Get Admin Pages getGroupPage should render a 404 page if no group is found
statusReason: Cannot destructure property 'group' of 'filteredGroups[0]' as it is undefined.

[Killed] StringLiteral
controllers/admin/pages.js:19:60
     const noGroupFound = filteredGroups.length === 0
 
     if (noGroupFound) {
-        return res.status(404).render(path.join(__dirname, '..', '..', 'views', '404.ejs'));
+        return res.status(404).render(path.join(__dirname, "", '..', 'views', '404.ejs'));
     } else {
         const { group, description, coins } = filteredGroups[0];
killedBy: Get Admin Pages getGroupPage should render a 404 page if no group is found
statusReason: expected false to be true

[Killed] StringLiteral
controllers/admin/pages.js:19:72
     const noGroupFound = filteredGroups.length === 0
 
     if (noGroupFound) {
-        return res.status(404).render(path.join(__dirname, '..', '..', 'views', '404.ejs'));
+        return res.status(404).render(path.join(__dirname, '..', '..', "", '404.ejs'));
     } else {
         const { group, description, coins } = filteredGroups[0];
killedBy: Get Admin Pages getGroupPage should render a 404 page if no group is found
statusReason: expected false to be true

[Killed] BlockStatement
controllers/admin/pages.js:20:12
 
     if (noGroupFound) {
         return res.status(404).render(path.join(__dirname, '..', '..', 'views', '404.ejs'));
-    } else {
-        const { group, description, coins } = filteredGroups[0];
-        return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'pages', 'group.ejs'), { group, description, coins });
-    }
+    } else {}
 };
 
killedBy: Get Admin Pages getGroupPage should render the group page if the group is found
statusReason: expected false to be true

[Killed] StringLiteral
controllers/admin/pages.js:22:60
         return res.status(404).render(path.join(__dirname, '..', '..', 'views', '404.ejs'));
     } else {
         const { group, description, coins } = filteredGroups[0];
-        return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'pages', 'group.ejs'), { group, description, coins });
+        return res.render(path.join(__dirname, '..', '..', "", 'admin', 'pages', 'group.ejs'), { group, description, coins });
     }
 };
killedBy: Get Admin Pages getGroupPage should render the group page if the group is found
statusReason: expected false to be true

[Killed] StringLiteral
controllers/admin/pages.js:22:54
         return res.status(404).render(path.join(__dirname, '..', '..', 'views', '404.ejs'));
     } else {
         const { group, description, coins } = filteredGroups[0];
-        return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'pages', 'group.ejs'), { group, description, coins });
+        return res.render(path.join(__dirname, '..', "", 'views', 'admin', 'pages', 'group.ejs'), { group, description, coins });
     }
 };
killedBy: Get Admin Pages getGroupPage should render the group page if the group is found
statusReason: expected false to be true

[Killed] BlockStatement
controllers/admin/pages.js:26:47
     }
 };
 
-const getCoinPage = async (req, res, next) => {
-    try {
-        const group = req.params.group;
-        const coinData = await Coins.findOne({ coin: req.params.coin });
-        const { coin, description, imageLink, resources } = coinData;
-        return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'pages', 'coin.ejs'), { group, coin, description, imageLink, resources });
-    } catch (error) {
-        next(error);
-    }
-};
+const getCoinPage = async (req, res, next) => {};
 
 const groupsController = { getMainPage, getGroupPage, getCoinPage };
killedBy: Get Admin Pages getCoinPage should render the coin page
statusReason: expected false to be true

[Killed] BlockStatement
controllers/admin/pages.js:27:9
 };
 
 const getCoinPage = async (req, res, next) => {
-    try {
-        const group = req.params.group;
-        const coinData = await Coins.findOne({ coin: req.params.coin });
-        const { coin, description, imageLink, resources } = coinData;
-        return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'pages', 'coin.ejs'), { group, coin, description, imageLink, resources });
-    } catch (error) {
+    try {} catch (error) {
         next(error);
     }
killedBy: Get Admin Pages getCoinPage should render the coin page
statusReason: expected false to be true

[Survived] ObjectLiteral
controllers/admin/pages.js:29:46
 const getCoinPage = async (req, res, next) => {
     try {
         const group = req.params.group;
-        const coinData = await Coins.findOne({ coin: req.params.coin });
+        const coinData = await Coins.findOne({});
         const { coin, description, imageLink, resources } = coinData;
         return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'pages', 'coin.ejs'), { group, coin, description, imageLink, resources });

[Killed] StringLiteral
controllers/admin/pages.js:31:78
         const group = req.params.group;
         const coinData = await Coins.findOne({ coin: req.params.coin });
         const { coin, description, imageLink, resources } = coinData;
-        return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'pages', 'coin.ejs'), { group, coin, description, imageLink, resources });
+        return res.render(path.join(__dirname, '..', '..', 'views', 'admin', "", 'coin.ejs'), { group, coin, description, imageLink, resources });
     } catch (error) {
         next(error);
killedBy: Get Admin Pages getCoinPage should render the coin page
statusReason: expected false to be true

[Killed] StringLiteral
controllers/admin/pages.js:31:54
         const group = req.params.group;
         const coinData = await Coins.findOne({ coin: req.params.coin });
         const { coin, description, imageLink, resources } = coinData;
-        return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'pages', 'coin.ejs'), { group, coin, description, imageLink, resources });
+        return res.render(path.join(__dirname, '..', "", 'views', 'admin', 'pages', 'coin.ejs'), { group, coin, description, imageLink, resources });
     } catch (error) {
         next(error);
killedBy: Get Admin Pages getCoinPage should render the coin page
statusReason: expected false to be true

[Killed] BlockStatement
controllers/admin/pages.js:32:21
         const coinData = await Coins.findOne({ coin: req.params.coin });
         const { coin, description, imageLink, resources } = coinData;
         return res.render(path.join(__dirname, '..', '..', 'views', 'admin', 'pages', 'coin.ejs'), { group, coin, description, imageLink, resources });
-    } catch (error) {
-        next(error);
-    }
+    } catch (error) {}
 };
 
killedBy: Get Admin Pages getCoinPage should call next with an error if there is a database error
statusReason: expected false to be true

[Killed] ObjectLiteral
controllers/admin/pages.js:37:26
     }
 };
 
-const groupsController = { getMainPage, getGroupPage, getCoinPage };
+const groupsController = {};
 
 export default groupsController;
killedBy: Get Admin Pages getMainPage should render the main page
statusReason: groupsController.getMainPage is not a function
