[Killed] BlockStatement
controllers/coins.js:8:51
 const __filename = fileURLToPath(import.meta.url); 
 const __dirname = path.dirname(__filename);
 
-const getSelectedCoin = async (req, res, next) => {
-    try {
-        const group = req.params.group;
-        const coinData = await Coins.findOne({ coin: req.params.coin });
-
-        if (coinData === null) {
-            return res.render(path.join(__dirname, '..', 'views', '404.ejs'));
-        } else {
-            const { coin, description, imageLink, resources } = coinData;
-            return res.render(path.join(__dirname, '..', 'views', 'coin.ejs'), { group, coin, description, imageLink, resources });
-        }
-    } catch (error) {
-        next(error);
-    }
-}
+const getSelectedCoin = async (req, res, next) => {}
 
 const deleteResource = async (req, res, next) => {
killedBy: Coins Controller getSelectedCoin should render a 404 page if coin is not found
statusReason: expected false to be true

[Killed] BlockStatement
controllers/coins.js:9:9
 const __dirname = path.dirname(__filename);
 
 const getSelectedCoin = async (req, res, next) => {
-    try {
-        const group = req.params.group;
-        const coinData = await Coins.findOne({ coin: req.params.coin });
-
-        if (coinData === null) {
-            return res.render(path.join(__dirname, '..', 'views', '404.ejs'));
-        } else {
-            const { coin, description, imageLink, resources } = coinData;
-            return res.render(path.join(__dirname, '..', 'views', 'coin.ejs'), { group, coin, description, imageLink, resources });
-        }
-    } catch (error) {
+    try {} catch (error) {
         next(error);
     }
killedBy: Coins Controller getSelectedCoin should render a 404 page if coin is not found
statusReason: expected false to be true

[Killed] BlockStatement
controllers/coins.js:13:32
         const group = req.params.group;
         const coinData = await Coins.findOne({ coin: req.params.coin });
 
-        if (coinData === null) {
-            return res.render(path.join(__dirname, '..', 'views', '404.ejs'));
-        } else {
+        if (coinData === null) {} else {
             const { coin, description, imageLink, resources } = coinData;
             return res.render(path.join(__dirname, '..', 'views', 'coin.ejs'), { group, coin, description, imageLink, resources });
killedBy: Coins Controller getSelectedCoin should render a 404 page if coin is not found
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/coins.js:13:13
         const group = req.params.group;
         const coinData = await Coins.findOne({ coin: req.params.coin });
 
-        if (coinData === null) {
+        if (false) {
             return res.render(path.join(__dirname, '..', 'views', '404.ejs'));
         } else {
killedBy: Coins Controller getSelectedCoin should render a 404 page if coin is not found
statusReason: expected false to be true

[Killed] StringLiteral
controllers/coins.js:14:52
         const coinData = await Coins.findOne({ coin: req.params.coin });
 
         if (coinData === null) {
-            return res.render(path.join(__dirname, '..', 'views', '404.ejs'));
+            return res.render(path.join(__dirname, "", 'views', '404.ejs'));
         } else {
             const { coin, description, imageLink, resources } = coinData;
killedBy: Coins Controller getSelectedCoin should render a 404 page if coin is not found
statusReason: expected false to be true

[Killed] BlockStatement
controllers/coins.js:15:16
 
         if (coinData === null) {
             return res.render(path.join(__dirname, '..', 'views', '404.ejs'));
-        } else {
-            const { coin, description, imageLink, resources } = coinData;
-            return res.render(path.join(__dirname, '..', 'views', 'coin.ejs'), { group, coin, description, imageLink, resources });
-        }
+        } else {}
     } catch (error) {
         next(error);
killedBy: Coins Controller getSelectedCoin should render the coin page if coin is found
statusReason: expected false to be true

[Killed] StringLiteral
controllers/coins.js:17:58
             return res.render(path.join(__dirname, '..', 'views', '404.ejs'));
         } else {
             const { coin, description, imageLink, resources } = coinData;
-            return res.render(path.join(__dirname, '..', 'views', 'coin.ejs'), { group, coin, description, imageLink, resources });
+            return res.render(path.join(__dirname, '..', "", 'coin.ejs'), { group, coin, description, imageLink, resources });
         }
     } catch (error) {
killedBy: Coins Controller getSelectedCoin should render the coin page if coin is found
statusReason: expected false to be true

[Killed] BlockStatement
controllers/coins.js:24:50
     }
 }
 
-const deleteResource = async (req, res, next) => {
-    try {
-        const { coin, resourceId } = req.body;
-        await Coins.updateOne({ coin }, { $pull: { resources: { _id: resourceId }} });
-        return res.redirect(`/${encodeURIComponent(req.params.group)}/${encodeURIComponent(coin)}/admin`);
-    } catch (error) {
-        next(error);
-    }
-}
+const deleteResource = async (req, res, next) => {}
 
 const addResource = async (req, res, next) => {
killedBy: Coins Controller deleteResource should delete the resource and redirect to the admin page
statusReason: expected false to be true

[Killed] BlockStatement
controllers/coins.js:25:9
 }
 
 const deleteResource = async (req, res, next) => {
-    try {
-        const { coin, resourceId } = req.body;
-        await Coins.updateOne({ coin }, { $pull: { resources: { _id: resourceId }} });
-        return res.redirect(`/${encodeURIComponent(req.params.group)}/${encodeURIComponent(coin)}/admin`);
-    } catch (error) {
+    try {} catch (error) {
         next(error);
     }
killedBy: Coins Controller deleteResource should delete the resource and redirect to the admin page
statusReason: expected false to be true

[Survived] ObjectLiteral
controllers/coins.js:27:50
 const deleteResource = async (req, res, next) => {
     try {
         const { coin, resourceId } = req.body;
-        await Coins.updateOne({ coin }, { $pull: { resources: { _id: resourceId }} });
+        await Coins.updateOne({ coin }, { $pull: {} });
         return res.redirect(`/${encodeURIComponent(req.params.group)}/${encodeURIComponent(coin)}/admin`);
     } catch (error) {

[Survived] ObjectLiteral
controllers/coins.js:27:31
 const deleteResource = async (req, res, next) => {
     try {
         const { coin, resourceId } = req.body;
-        await Coins.updateOne({ coin }, { $pull: { resources: { _id: resourceId }} });
+        await Coins.updateOne({}, { $pull: { resources: { _id: resourceId }} });
         return res.redirect(`/${encodeURIComponent(req.params.group)}/${encodeURIComponent(coin)}/admin`);
     } catch (error) {

[Killed] StringLiteral
controllers/coins.js:28:29
     try {
         const { coin, resourceId } = req.body;
         await Coins.updateOne({ coin }, { $pull: { resources: { _id: resourceId }} });
-        return res.redirect(`/${encodeURIComponent(req.params.group)}/${encodeURIComponent(coin)}/admin`);
+        return res.redirect(``);
     } catch (error) {
         next(error);
killedBy: Coins Controller deleteResource should delete the resource and redirect to the admin page
statusReason: expected false to be true

[Killed] BlockStatement
controllers/coins.js:29:21
         const { coin, resourceId } = req.body;
         await Coins.updateOne({ coin }, { $pull: { resources: { _id: resourceId }} });
         return res.redirect(`/${encodeURIComponent(req.params.group)}/${encodeURIComponent(coin)}/admin`);
-    } catch (error) {
-        next(error);
-    }
+    } catch (error) {}
 }
 
killedBy: Coins Controller deleteResource should call next with an error if there is a database error
statusReason: expected false to be true

[Killed] BlockStatement
controllers/coins.js:34:47
     }
 }
 
-const addResource = async (req, res, next) => {
-    try {
-        const { group, coin } = req.params;
-        const { resource, imageLink, hyperlink } = req.body
-        await Coins.updateOne({ coin }, { $push: { resources: { resource, imageLink, hyperlink } } });
-        return res.redirect(`/${encodeURIComponent(group)}/${encodeURIComponent(coin)}/admin`);
-    } catch (error) {
-        next(error);
-    }
-}
+const addResource = async (req, res, next) => {}
 
 const updateResource = async (req, res, next) => {
killedBy: Coins Controller addResource should add a new resource and redirect to the admin page
statusReason: expected false to be true

[Killed] BlockStatement
controllers/coins.js:35:9
 }
 
 const addResource = async (req, res, next) => {
-    try {
-        const { group, coin } = req.params;
-        const { resource, imageLink, hyperlink } = req.body
-        await Coins.updateOne({ coin }, { $push: { resources: { resource, imageLink, hyperlink } } });
-        return res.redirect(`/${encodeURIComponent(group)}/${encodeURIComponent(coin)}/admin`);
-    } catch (error) {
+    try {} catch (error) {
         next(error);
     }
killedBy: Coins Controller addResource should add a new resource and redirect to the admin page
statusReason: expected false to be true

[Survived] ObjectLiteral
controllers/coins.js:38:41
     try {
         const { group, coin } = req.params;
         const { resource, imageLink, hyperlink } = req.body
-        await Coins.updateOne({ coin }, { $push: { resources: { resource, imageLink, hyperlink } } });
+        await Coins.updateOne({ coin }, {});
         return res.redirect(`/${encodeURIComponent(group)}/${encodeURIComponent(coin)}/admin`);
     } catch (error) {

[Survived] ObjectLiteral
controllers/coins.js:38:50
     try {
         const { group, coin } = req.params;
         const { resource, imageLink, hyperlink } = req.body
-        await Coins.updateOne({ coin }, { $push: { resources: { resource, imageLink, hyperlink } } });
+        await Coins.updateOne({ coin }, { $push: {} });
         return res.redirect(`/${encodeURIComponent(group)}/${encodeURIComponent(coin)}/admin`);
     } catch (error) {

[Killed] StringLiteral
controllers/coins.js:39:29
         const { group, coin } = req.params;
         const { resource, imageLink, hyperlink } = req.body
         await Coins.updateOne({ coin }, { $push: { resources: { resource, imageLink, hyperlink } } });
-        return res.redirect(`/${encodeURIComponent(group)}/${encodeURIComponent(coin)}/admin`);
+        return res.redirect(``);
     } catch (error) {
         next(error);
killedBy: Coins Controller addResource should add a new resource and redirect to the admin page
statusReason: expected false to be true

[Killed] BlockStatement
controllers/coins.js:40:21
         const { resource, imageLink, hyperlink } = req.body
         await Coins.updateOne({ coin }, { $push: { resources: { resource, imageLink, hyperlink } } });
         return res.redirect(`/${encodeURIComponent(group)}/${encodeURIComponent(coin)}/admin`);
-    } catch (error) {
-        next(error);
-    }
+    } catch (error) {}
 }
 
killedBy: Coins Controller addResource should call next with an error if there is a database error
statusReason: expected false to be true

[Killed] BlockStatement
controllers/coins.js:45:50
     }
 }
 
-const updateResource = async (req, res, next) => {
-    try {
-        const { group, coin } = req.params;
-        const { resource, imageLink, hyperlink, resourceId } = req.body;
-        await Coins.updateOne({ 
-            coin,
-            "resources._id": resourceId
-        } , {
-            $set: {
-                "resources.$.resource": resource,
-                "resources.$.imageLink": imageLink,
-                "resources.$.hyperlink": hyperlink
-            }
-        });
-        return res.redirect(`/${encodeURIComponent(group)}/${encodeURIComponent(coin)}/admin`);
-    } catch (error) {
-        next(error);
-    }
-}
+const updateResource = async (req, res, next) => {}
 
 const coinsController = { getSelectedCoin, deleteResource, addResource, updateResource };
killedBy: Coins Controller updateResource should update the resource and redirect to the admin page
statusReason: expected false to be true

[Killed] BlockStatement
controllers/coins.js:46:9
 }
 
 const updateResource = async (req, res, next) => {
-    try {
-        const { group, coin } = req.params;
-        const { resource, imageLink, hyperlink, resourceId } = req.body;
-        await Coins.updateOne({ 
-            coin,
-            "resources._id": resourceId
-        } , {
-            $set: {
-                "resources.$.resource": resource,
-                "resources.$.imageLink": imageLink,
-                "resources.$.hyperlink": hyperlink
-            }
-        });
-        return res.redirect(`/${encodeURIComponent(group)}/${encodeURIComponent(coin)}/admin`);
-    } catch (error) {
+    try {} catch (error) {
         next(error);
     }
killedBy: Coins Controller updateResource should update the resource and redirect to the admin page
statusReason: expected false to be true

[Survived] ObjectLiteral
controllers/coins.js:49:31
     try {
         const { group, coin } = req.params;
         const { resource, imageLink, hyperlink, resourceId } = req.body;
-        await Coins.updateOne({ 
-            coin,
-            "resources._id": resourceId
-        } , {
+        await Coins.updateOne({} , {
             $set: {
                 "resources.$.resource": resource,

[Survived] ObjectLiteral
controllers/coins.js:52:13
         await Coins.updateOne({ 
             coin,
             "resources._id": resourceId
-        } , {
-            $set: {
-                "resources.$.resource": resource,
-                "resources.$.imageLink": imageLink,
-                "resources.$.hyperlink": hyperlink
-            }
-        });
+        } , {});
         return res.redirect(`/${encodeURIComponent(group)}/${encodeURIComponent(coin)}/admin`);
     } catch (error) {

[Survived] ObjectLiteral
controllers/coins.js:53:19
             coin,
             "resources._id": resourceId
         } , {
-            $set: {
-                "resources.$.resource": resource,
-                "resources.$.imageLink": imageLink,
-                "resources.$.hyperlink": hyperlink
-            }
+            $set: {}
         });
         return res.redirect(`/${encodeURIComponent(group)}/${encodeURIComponent(coin)}/admin`);
