[Killed] BlockStatement
controllers/FAQ_items.js:3:47
 import FAQItems from '../models/FAQ_items.js';
 
-const getFAQItems = async (req, res, next) => {
-    try {
-        const items = await FAQItems.find({});
-        return res.status(200).json({
-            message: 'Success',
-            data: {
-                items
-            }
-        });
-    } catch (error) {
-        next(error);
-    }
-
-}
+const getFAQItems = async (req, res, next) => {}
 
 const FAQItemsController = { getFAQItems };
killedBy: FAQItemsController getFAQItems should return all FAQ items with a status of 200
statusReason: expected false to be true

[Killed] BlockStatement
controllers/FAQ_items.js:4:9
 import FAQItems from '../models/FAQ_items.js';
 
 const getFAQItems = async (req, res, next) => {
-    try {
-        const items = await FAQItems.find({});
-        return res.status(200).json({
-            message: 'Success',
-            data: {
-                items
-            }
-        });
-    } catch (error) {
+    try {} catch (error) {
         next(error);
     }
killedBy: FAQItemsController getFAQItems should return all FAQ items with a status of 200
statusReason: expected false to be true

[Killed] StringLiteral
controllers/FAQ_items.js:7:22
     try {
         const items = await FAQItems.find({});
         return res.status(200).json({
-            message: 'Success',
+            message: "",
             data: {
                 items
killedBy: FAQItemsController getFAQItems should return all FAQ items with a status of 200
statusReason: expected false to be true
