[Killed] BlockStatement
controllers/global_groups.js:12:49
 
 const globalGroupsModel = new GlobalGroupsModel();
 
-const getCategories = async (req, res, next) => {
-    try {
-        res.locals.encode = encodeURIComponent;
-        res.locals.categories = await Groups.distinct('category');
-        res.locals.groups = await globalGroupsModel.getGroupsWithSortedCoins();
-        next();
-    } catch (error) {
-        next(error);
-    }
-}
+const getCategories = async (req, res, next) => {}
 
 const getGroups = (req, res) => {
killedBy: globalGroupsController getCategories should set categories and groups in res.locals and call next
statusReason: expected undefined to deeply equal [ 'Category1', 'Category2' ]

[Killed] BlockStatement
controllers/global_groups.js:13:9
 const globalGroupsModel = new GlobalGroupsModel();
 
 const getCategories = async (req, res, next) => {
-    try {
-        res.locals.encode = encodeURIComponent;
-        res.locals.categories = await Groups.distinct('category');
-        res.locals.groups = await globalGroupsModel.getGroupsWithSortedCoins();
-        next();
-    } catch (error) {
+    try {} catch (error) {
         next(error);
     }
killedBy: globalGroupsController getCategories should set categories and groups in res.locals and call next
statusReason: expected undefined to deeply equal [ 'Category1', 'Category2' ]

[Survived] StringLiteral
controllers/global_groups.js:15:55
 const getCategories = async (req, res, next) => {
     try {
         res.locals.encode = encodeURIComponent;
-        res.locals.categories = await Groups.distinct('category');
+        res.locals.categories = await Groups.distinct("");
         res.locals.groups = await globalGroupsModel.getGroupsWithSortedCoins();
         next();

[Killed] BlockStatement
controllers/global_groups.js:18:21
         res.locals.categories = await Groups.distinct('category');
         res.locals.groups = await globalGroupsModel.getGroupsWithSortedCoins();
         next();
-    } catch (error) {
-        next(error);
-    }
+    } catch (error) {}
 }
 
killedBy: globalGroupsController getCategories should call next with an error if there is a database error
statusReason: expected false to be true

[Killed] BlockStatement
controllers/global_groups.js:23:33
     }
 }
 
-const getGroups = (req, res) => {
-    const { groups } = res.locals;
-    return res.render(path.join(__dirname, '..', 'views', 'groups.ejs'), { groups });
-}
+const getGroups = (req, res) => {}
 
 const fetchSearchResults = async (req, res, next) => {
killedBy: globalGroupsController getGroups should render the groups view with groups from res.locals
statusReason: expected false to be true

[Killed] StringLiteral
controllers/global_groups.js:25:44
 
 const getGroups = (req, res) => {
     const { groups } = res.locals;
-    return res.render(path.join(__dirname, '..', 'views', 'groups.ejs'), { groups });
+    return res.render(path.join(__dirname, "", 'views', 'groups.ejs'), { groups });
 }
 
killedBy: globalGroupsController getGroups should render the groups view with groups from res.locals
statusReason: expected false to be true

[Killed] StringLiteral
controllers/global_groups.js:25:50
 
 const getGroups = (req, res) => {
     const { groups } = res.locals;
-    return res.render(path.join(__dirname, '..', 'views', 'groups.ejs'), { groups });
+    return res.render(path.join(__dirname, '..', "", 'groups.ejs'), { groups });
 }
 
killedBy: globalGroupsController getGroups should render the groups view with groups from res.locals
statusReason: expected false to be true

[Killed] BlockStatement
controllers/global_groups.js:28:54
     return res.render(path.join(__dirname, '..', 'views', 'groups.ejs'), { groups });
 }
 
-const fetchSearchResults = async (req, res, next) => {
-    try {
-        const query = req.query.coin;
-        res.locals.results = await globalGroupsModel.searchByCoin(query);
-        return res.render(path.join(__dirname, '..', 'views', 'results.ejs'));
-    } catch (error) {
-        next(error);
-    }
-}
+const fetchSearchResults = async (req, res, next) => {}
 
 const globalGroupsController = { getCategories, getGroups, fetchSearchResults };
killedBy: globalGroupsController fetchSearchResults should render the results view with search results
statusReason: expected undefined to deeply equal [ { coin: 'TestCoin1' }, …(1) ]

[Killed] BlockStatement
controllers/global_groups.js:29:9
 }
 
 const fetchSearchResults = async (req, res, next) => {
-    try {
-        const query = req.query.coin;
-        res.locals.results = await globalGroupsModel.searchByCoin(query);
-        return res.render(path.join(__dirname, '..', 'views', 'results.ejs'));
-    } catch (error) {
+    try {} catch (error) {
         next(error);
     }
killedBy: globalGroupsController fetchSearchResults should render the results view with search results
statusReason: expected undefined to deeply equal [ { coin: 'TestCoin1' }, …(1) ]

[Killed] StringLiteral
controllers/global_groups.js:32:48
     try {
         const query = req.query.coin;
         res.locals.results = await globalGroupsModel.searchByCoin(query);
-        return res.render(path.join(__dirname, '..', 'views', 'results.ejs'));
+        return res.render(path.join(__dirname, "", 'views', 'results.ejs'));
     } catch (error) {
         next(error);
killedBy: globalGroupsController fetchSearchResults should render the results view with search results
statusReason: expected false to be true

[Killed] BlockStatement
controllers/global_groups.js:33:21
         const query = req.query.coin;
         res.locals.results = await globalGroupsModel.searchByCoin(query);
         return res.render(path.join(__dirname, '..', 'views', 'results.ejs'));
-    } catch (error) {
-        next(error);
-    }
+    } catch (error) {}
 }
 
killedBy: globalGroupsController fetchSearchResults should call next with an error if there is a database error
statusReason: expected false to be true
