[Killed] BlockStatement
controllers/groups.js:9:45
 const __filename = fileURLToPath(import.meta.url); 
 const __dirname = path.dirname(__filename);
 
-const fetchGroup = async(req, res, next) => {
-    try {
-        const groupData = await Groups.findOne({ group: req.params.group });
-    
-        if (!groupData) {
-          return res.status(404).render(path.join(__dirname, '..', 'views', '404.ejs'));
-        } else {
-          return res.render(path.join(__dirname, '..', 'views', 'group.ejs'), { 
-            group: groupData.group, 
-            description: groupData.description, 
-            coins: groupData.coins.sort() 
-          });
-        }
-    } catch (error) {
-        next(error);
-    }
-}
+const fetchGroup = async(req, res, next) => {}
 
 const addGroup = async (req, res, next) => {
killedBy: Groups Controller fetchGroup should render the group view if group is found
statusReason: expected false to be true

[Killed] BlockStatement
controllers/groups.js:10:9
 const __dirname = path.dirname(__filename);
 
 const fetchGroup = async(req, res, next) => {
-    try {
-        const groupData = await Groups.findOne({ group: req.params.group });
-    
-        if (!groupData) {
-          return res.status(404).render(path.join(__dirname, '..', 'views', '404.ejs'));
-        } else {
-          return res.render(path.join(__dirname, '..', 'views', 'group.ejs'), { 
-            group: groupData.group, 
-            description: groupData.description, 
-            coins: groupData.coins.sort() 
-          });
-        }
-    } catch (error) {
+    try {} catch (error) {
         next(error);
     }
killedBy: Groups Controller fetchGroup should render the group view if group is found
statusReason: expected false to be true

[Killed] ObjectLiteral
controllers/groups.js:11:48
 
 const fetchGroup = async(req, res, next) => {
     try {
-        const groupData = await Groups.findOne({ group: req.params.group });
+        const groupData = await Groups.findOne({});
     
         if (!groupData) {
killedBy: Groups Controller fetchGroup should render the group view if group is found
statusReason: expected false to be true

[Killed] BooleanLiteral
controllers/groups.js:13:13
     try {
         const groupData = await Groups.findOne({ group: req.params.group });
     
-        if (!groupData) {
+        if (groupData) {
           return res.status(404).render(path.join(__dirname, '..', 'views', '404.ejs'));
         } else {
killedBy: Groups Controller fetchGroup should render the group view if group is found
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/groups.js:13:13
     try {
         const groupData = await Groups.findOne({ group: req.params.group });
     
-        if (!groupData) {
+        if (false) {
           return res.status(404).render(path.join(__dirname, '..', 'views', '404.ejs'));
         } else {
killedBy: Groups Controller fetchGroup should render 404 page if group is not found
statusReason: expected false to be true

[Killed] StringLiteral
controllers/groups.js:14:68
         const groupData = await Groups.findOne({ group: req.params.group });
     
         if (!groupData) {
-          return res.status(404).render(path.join(__dirname, '..', 'views', '404.ejs'));
+          return res.status(404).render(path.join(__dirname, '..', "", '404.ejs'));
         } else {
           return res.render(path.join(__dirname, '..', 'views', 'group.ejs'), { 
killedBy: Groups Controller fetchGroup should render 404 page if group is not found
statusReason: expected false to be true

[Killed] BlockStatement
controllers/groups.js:15:16
     
         if (!groupData) {
           return res.status(404).render(path.join(__dirname, '..', 'views', '404.ejs'));
-        } else {
-          return res.render(path.join(__dirname, '..', 'views', 'group.ejs'), { 
-            group: groupData.group, 
-            description: groupData.description, 
-            coins: groupData.coins.sort() 
-          });
-        }
+        } else {}
     } catch (error) {
         next(error);
killedBy: Groups Controller fetchGroup should render the group view if group is found
statusReason: expected false to be true

[Killed] StringLiteral
controllers/groups.js:16:56
         if (!groupData) {
           return res.status(404).render(path.join(__dirname, '..', 'views', '404.ejs'));
         } else {
-          return res.render(path.join(__dirname, '..', 'views', 'group.ejs'), { 
+          return res.render(path.join(__dirname, '..', "", 'group.ejs'), { 
             group: groupData.group, 
             description: groupData.description, 
killedBy: Groups Controller fetchGroup should render the group view if group is found
statusReason: expected false to be true

[Survived] MethodExpression
controllers/groups.js:19:20
           return res.render(path.join(__dirname, '..', 'views', 'group.ejs'), { 
             group: groupData.group, 
             description: groupData.description, 
-            coins: groupData.coins.sort() 
+            coins: groupData.coins 
           });
         }

[Killed] BlockStatement
controllers/groups.js:27:44
     }
 }
 
-const addGroup = async (req, res, next) => {
-    try {
-        const { category, group, description } = req.body;
-
-        const groupCheck = await Groups.findOne({ group }) === null;
-        
-        if (groupCheck) {
-            await Groups.create({ category, group, description });
-            req.session.oldInput = {};
-            return res.redirect(`/${encodeURIComponent(group)}/admin`);
-        } else {
-            req.flash('error', 'This group already exists in our database. Please update the existing group or choose a different group name.');
-            req.session.oldInput = { category, group, description };
-            return req.session.save(error => error ? next(error) : res.redirect('/admin/add-group-form'));
-        }
-    } catch (error) {
-        next(error);
-    }
-}
+const addGroup = async (req, res, next) => {}
 
 const updateGroup = async (req, res, next) => {
killedBy: Groups Controller addGroup should redirect to group admin page if group is added successfully
statusReason: expected false to be true

[Killed] BlockStatement
controllers/groups.js:28:9
 }
 
 const addGroup = async (req, res, next) => {
-    try {
-        const { category, group, description } = req.body;
-
-        const groupCheck = await Groups.findOne({ group }) === null;
-        
-        if (groupCheck) {
-            await Groups.create({ category, group, description });
-            req.session.oldInput = {};
-            return res.redirect(`/${encodeURIComponent(group)}/admin`);
-        } else {
-            req.flash('error', 'This group already exists in our database. Please update the existing group or choose a different group name.');
-            req.session.oldInput = { category, group, description };
-            return req.session.save(error => error ? next(error) : res.redirect('/admin/add-group-form'));
-        }
-    } catch (error) {
+    try {} catch (error) {
         next(error);
     }
killedBy: Groups Controller addGroup should redirect to group admin page if group is added successfully
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/groups.js:31:28
     try {
         const { category, group, description } = req.body;
 
-        const groupCheck = await Groups.findOne({ group }) === null;
+        const groupCheck = false;
         
         if (groupCheck) {
killedBy: Groups Controller addGroup should redirect to group admin page if group is added successfully
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/groups.js:31:28
     try {
         const { category, group, description } = req.body;
 
-        const groupCheck = await Groups.findOne({ group }) === null;
+        const groupCheck = true;
         
         if (groupCheck) {
killedBy: Groups Controller addGroup should flash an error message if group already exists in the database
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/groups.js:33:13
 
         const groupCheck = await Groups.findOne({ group }) === null;
         
-        if (groupCheck) {
+        if (false) {
             await Groups.create({ category, group, description });
             req.session.oldInput = {};
killedBy: Groups Controller addGroup should redirect to group admin page if group is added successfully
statusReason: expected false to be true

[Killed] BlockStatement
controllers/groups.js:33:25
 
         const groupCheck = await Groups.findOne({ group }) === null;
         
-        if (groupCheck) {
-            await Groups.create({ category, group, description });
-            req.session.oldInput = {};
-            return res.redirect(`/${encodeURIComponent(group)}/admin`);
-        } else {
+        if (groupCheck) {} else {
             req.flash('error', 'This group already exists in our database. Please update the existing group or choose a different group name.');
             req.session.oldInput = { category, group, description };
killedBy: Groups Controller addGroup should redirect to group admin page if group is added successfully
statusReason: expected false to be true

[Survived] ObjectLiteral
controllers/groups.js:34:33
         const groupCheck = await Groups.findOne({ group }) === null;
         
         if (groupCheck) {
-            await Groups.create({ category, group, description });
+            await Groups.create({});
             req.session.oldInput = {};
             return res.redirect(`/${encodeURIComponent(group)}/admin`);

[Killed] BlockStatement
controllers/groups.js:37:16
             await Groups.create({ category, group, description });
             req.session.oldInput = {};
             return res.redirect(`/${encodeURIComponent(group)}/admin`);
-        } else {
-            req.flash('error', 'This group already exists in our database. Please update the existing group or choose a different group name.');
-            req.session.oldInput = { category, group, description };
-            return req.session.save(error => error ? next(error) : res.redirect('/admin/add-group-form'));
-        }
+        } else {}
     } catch (error) {
         next(error);
killedBy: Groups Controller addGroup should flash an error message if group already exists in the database
statusReason: expected false to be true

[Killed] StringLiteral
controllers/groups.js:38:23
             req.session.oldInput = {};
             return res.redirect(`/${encodeURIComponent(group)}/admin`);
         } else {
-            req.flash('error', 'This group already exists in our database. Please update the existing group or choose a different group name.');
+            req.flash("", 'This group already exists in our database. Please update the existing group or choose a different group name.');
             req.session.oldInput = { category, group, description };
             return req.session.save(error => error ? next(error) : res.redirect('/admin/add-group-form'));
killedBy: Groups Controller addGroup should flash an error message if group already exists in the database
statusReason: expected false to be true

[Killed] ArrowFunction
controllers/groups.js:40:37
         } else {
             req.flash('error', 'This group already exists in our database. Please update the existing group or choose a different group name.');
             req.session.oldInput = { category, group, description };
-            return req.session.save(error => error ? next(error) : res.redirect('/admin/add-group-form'));
+            return req.session.save(() => undefined);
         }
     } catch (error) {
killedBy: Groups Controller addGroup should flash an error message if group already exists in the database
statusReason: expected false to be true

[Killed] BlockStatement
controllers/groups.js:47:47
     }
 }
 
-const updateGroup = async (req, res, next) => {
-    try {
-        const { category, group, description } = req.body;
-
-        const groupData = await Groups.findOne({ group });
-
-        if (groupData === null || groupData.group === req.params.group) {
-            const query = { group: req.params.group };
-            await Groups.updateOne (query, { category, group, description });
-            return res.redirect(`/admin`);
-        } else {
-            req.flash('error', 'This group already exists in our database. Please update the existing group or choose a different group name.');
-            return req.session.save(error => error ? next(error) : res.redirect(`/${encodeURIComponent(req.params.group)}/admin/update-group-form`));
-        }
-    } catch (error) {
-        next(error);
-    }
-}
+const updateGroup = async (req, res, next) => {}
 
 const deleteGroup = async (req, res, next) => {
killedBy: Groups Controller updateGroup should redirect to admin page if group is updated successfully
statusReason: expected false to be true

[Killed] BlockStatement
controllers/groups.js:48:9
 }
 
 const updateGroup = async (req, res, next) => {
-    try {
-        const { category, group, description } = req.body;
-
-        const groupData = await Groups.findOne({ group });
-
-        if (groupData === null || groupData.group === req.params.group) {
-            const query = { group: req.params.group };
-            await Groups.updateOne (query, { category, group, description });
-            return res.redirect(`/admin`);
-        } else {
-            req.flash('error', 'This group already exists in our database. Please update the existing group or choose a different group name.');
-            return req.session.save(error => error ? next(error) : res.redirect(`/${encodeURIComponent(req.params.group)}/admin/update-group-form`));
-        }
-    } catch (error) {
+    try {} catch (error) {
         next(error);
     }
killedBy: Groups Controller updateGroup should redirect to admin page if group is updated successfully
statusReason: expected false to be true

[Killed] EqualityOperator
controllers/groups.js:53:35
 
         const groupData = await Groups.findOne({ group });
 
-        if (groupData === null || groupData.group === req.params.group) {
+        if (groupData === null || groupData.group !== req.params.group) {
             const query = { group: req.params.group };
             await Groups.updateOne (query, { category, group, description });
killedBy: Groups Controller updateGroup should redirect to admin page if group is updated successfully
statusReason: expected false to be true

[Killed] EqualityOperator
controllers/groups.js:53:13
 
         const groupData = await Groups.findOne({ group });
 
-        if (groupData === null || groupData.group === req.params.group) {
+        if (groupData !== null || groupData.group === req.params.group) {
             const query = { group: req.params.group };
             await Groups.updateOne (query, { category, group, description });
killedBy: Groups Controller updateGroup should flash an error message if group name is changed to another existing group's name
statusReason: expected false to be true

[Survived] ObjectLiteral
controllers/groups.js:54:27
         const groupData = await Groups.findOne({ group });
 
         if (groupData === null || groupData.group === req.params.group) {
-            const query = { group: req.params.group };
+            const query = {};
             await Groups.updateOne (query, { category, group, description });
             return res.redirect(`/admin`);

[Killed] BlockStatement
controllers/groups.js:57:16
             const query = { group: req.params.group };
             await Groups.updateOne (query, { category, group, description });
             return res.redirect(`/admin`);
-        } else {
-            req.flash('error', 'This group already exists in our database. Please update the existing group or choose a different group name.');
-            return req.session.save(error => error ? next(error) : res.redirect(`/${encodeURIComponent(req.params.group)}/admin/update-group-form`));
-        }
+        } else {}
     } catch (error) {
         next(error);
killedBy: Groups Controller updateGroup should flash an error message if group name is changed to another existing group's name
statusReason: expected false to be true

[Killed] ArrowFunction
controllers/groups.js:59:37
             return res.redirect(`/admin`);
         } else {
             req.flash('error', 'This group already exists in our database. Please update the existing group or choose a different group name.');
-            return req.session.save(error => error ? next(error) : res.redirect(`/${encodeURIComponent(req.params.group)}/admin/update-group-form`));
+            return req.session.save(() => undefined);
         }
     } catch (error) {
killedBy: Groups Controller updateGroup should flash an error message if group name is changed to another existing group's name
statusReason: expected false to be true

[Killed] BlockStatement
controllers/groups.js:66:47
     }
 }
 
-const deleteGroup = async (req, res, next) => {
-    try {
-        await Groups.deleteOne({ group: req.body.group });
-        return res.redirect('/admin');
-    } catch (error) {
-        next(error);
-    }
-}
+const deleteGroup = async (req, res, next) => {}
 
 const addCoin = async (req, res, next) => {
killedBy: Groups Controller deleteGroup should redirect to admin page if group is deleted successfully
statusReason: expected false to be true

[Killed] BlockStatement
controllers/groups.js:67:9
 }
 
 const deleteGroup = async (req, res, next) => {
-    try {
-        await Groups.deleteOne({ group: req.body.group });
-        return res.redirect('/admin');
-    } catch (error) {
+    try {} catch (error) {
         next(error);
     }
killedBy: Groups Controller deleteGroup should redirect to admin page if group is deleted successfully
statusReason: expected false to be true

[Survived] ObjectLiteral
controllers/groups.js:68:32
 
 const deleteGroup = async (req, res, next) => {
     try {
-        await Groups.deleteOne({ group: req.body.group });
+        await Groups.deleteOne({});
         return res.redirect('/admin');
     } catch (error) {

[Killed] BlockStatement
controllers/groups.js:70:21
     try {
         await Groups.deleteOne({ group: req.body.group });
         return res.redirect('/admin');
-    } catch (error) {
-        next(error);
-    }
+    } catch (error) {}
 }
 
killedBy: Groups Controller deleteGroup should call next with an error if database query fails
statusReason: expected false to be true

[Killed] BlockStatement
controllers/groups.js:75:43
     }
 }
 
-const addCoin = async (req, res, next) => {
-    try {
-
-        const { group, coin, coinLogoLink, description, imageLink } = req.body
-        const coinCheck = await Coins.findOne({ coin }) === null;
-
-        if (coinCheck) {
-            await Groups.updateOne({ group }, { $push: { coins: { coin, coinLogoLink } } });
-            await Coins.create({ coin, description, imageLink, resources: [] });
-            req.session.oldInput = {};
-            return res.redirect(`/${encodeURIComponent(group)}/admin`);
-        } else {
-            req.flash('error', 'This coin already exists in our database. Please update the existing coin or choose a different name.');
-            req.session.oldInput = { group, coin, coinLogoLink, description, imageLink };
-            return req.session.save(error => error ? next(error) : res.redirect('/admin/add-coin-form'));
-        }
-    } catch (error) {
-        next(error);
-    }
-}
+const addCoin = async (req, res, next) => {}
 
 const updateCoin = async (req, res, next) => {
killedBy: Groups Controller addCoin should redirect to coin admin page if coin is added successfully
statusReason: expected false to be true

[Killed] BlockStatement
controllers/groups.js:76:9
 }
 
 const addCoin = async (req, res, next) => {
-    try {
-
-        const { group, coin, coinLogoLink, description, imageLink } = req.body
-        const coinCheck = await Coins.findOne({ coin }) === null;
-
-        if (coinCheck) {
-            await Groups.updateOne({ group }, { $push: { coins: { coin, coinLogoLink } } });
-            await Coins.create({ coin, description, imageLink, resources: [] });
-            req.session.oldInput = {};
-            return res.redirect(`/${encodeURIComponent(group)}/admin`);
-        } else {
-            req.flash('error', 'This coin already exists in our database. Please update the existing coin or choose a different name.');
-            req.session.oldInput = { group, coin, coinLogoLink, description, imageLink };
-            return req.session.save(error => error ? next(error) : res.redirect('/admin/add-coin-form'));
-        }
-    } catch (error) {
+    try {} catch (error) {
         next(error);
     }
killedBy: Groups Controller addCoin should redirect to coin admin page if coin is added successfully
statusReason: expected false to be true

[Killed] EqualityOperator
controllers/groups.js:79:27
     try {
 
         const { group, coin, coinLogoLink, description, imageLink } = req.body
-        const coinCheck = await Coins.findOne({ coin }) === null;
+        const coinCheck = (await Coins.findOne({
+  coin
+})) !== null;
 
         if (coinCheck) {
killedBy: Groups Controller addCoin should redirect to coin admin page if coin is added successfully
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/groups.js:79:27
     try {
 
         const { group, coin, coinLogoLink, description, imageLink } = req.body
-        const coinCheck = await Coins.findOne({ coin }) === null;
+        const coinCheck = true;
 
         if (coinCheck) {
killedBy: Groups Controller addCoin should flash an error message if coin already exists in the database
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/groups.js:81:13
         const { group, coin, coinLogoLink, description, imageLink } = req.body
         const coinCheck = await Coins.findOne({ coin }) === null;
 
-        if (coinCheck) {
+        if (false) {
             await Groups.updateOne({ group }, { $push: { coins: { coin, coinLogoLink } } });
             await Coins.create({ coin, description, imageLink, resources: [] });
killedBy: Groups Controller addCoin should redirect to coin admin page if coin is added successfully
statusReason: expected false to be true

[Killed] BlockStatement
controllers/groups.js:81:24
         const { group, coin, coinLogoLink, description, imageLink } = req.body
         const coinCheck = await Coins.findOne({ coin }) === null;
 
-        if (coinCheck) {
-            await Groups.updateOne({ group }, { $push: { coins: { coin, coinLogoLink } } });
-            await Coins.create({ coin, description, imageLink, resources: [] });
-            req.session.oldInput = {};
-            return res.redirect(`/${encodeURIComponent(group)}/admin`);
-        } else {
+        if (coinCheck) {} else {
             req.flash('error', 'This coin already exists in our database. Please update the existing coin or choose a different name.');
             req.session.oldInput = { group, coin, coinLogoLink, description, imageLink };
killedBy: Groups Controller addCoin should redirect to coin admin page if coin is added successfully
statusReason: expected false to be true

[Survived] ObjectLiteral
controllers/groups.js:82:36
         const coinCheck = await Coins.findOne({ coin }) === null;
 
         if (coinCheck) {
-            await Groups.updateOne({ group }, { $push: { coins: { coin, coinLogoLink } } });
+            await Groups.updateOne({}, { $push: { coins: { coin, coinLogoLink } } });
             await Coins.create({ coin, description, imageLink, resources: [] });
             req.session.oldInput = {};

[Survived] ObjectLiteral
controllers/groups.js:82:56
         const coinCheck = await Coins.findOne({ coin }) === null;
 
         if (coinCheck) {
-            await Groups.updateOne({ group }, { $push: { coins: { coin, coinLogoLink } } });
+            await Groups.updateOne({ group }, { $push: {} });
             await Coins.create({ coin, description, imageLink, resources: [] });
             req.session.oldInput = {};

[Survived] ArrayDeclaration
controllers/groups.js:83:75
 
         if (coinCheck) {
             await Groups.updateOne({ group }, { $push: { coins: { coin, coinLogoLink } } });
-            await Coins.create({ coin, description, imageLink, resources: [] });
+            await Coins.create({ coin, description, imageLink, resources: ["Stryker was here"] });
             req.session.oldInput = {};
             return res.redirect(`/${encodeURIComponent(group)}/admin`);

[Survived] ObjectLiteral
controllers/groups.js:83:32
 
         if (coinCheck) {
             await Groups.updateOne({ group }, { $push: { coins: { coin, coinLogoLink } } });
-            await Coins.create({ coin, description, imageLink, resources: [] });
+            await Coins.create({});
             req.session.oldInput = {};
             return res.redirect(`/${encodeURIComponent(group)}/admin`);

[Killed] BlockStatement
controllers/groups.js:86:16
             await Coins.create({ coin, description, imageLink, resources: [] });
             req.session.oldInput = {};
             return res.redirect(`/${encodeURIComponent(group)}/admin`);
-        } else {
-            req.flash('error', 'This coin already exists in our database. Please update the existing coin or choose a different name.');
-            req.session.oldInput = { group, coin, coinLogoLink, description, imageLink };
-            return req.session.save(error => error ? next(error) : res.redirect('/admin/add-coin-form'));
-        }
+        } else {}
     } catch (error) {
         next(error);
killedBy: Groups Controller addCoin should flash an error message if coin already exists in the database
statusReason: expected false to be true

[Killed] ArrowFunction
controllers/groups.js:89:37
         } else {
             req.flash('error', 'This coin already exists in our database. Please update the existing coin or choose a different name.');
             req.session.oldInput = { group, coin, coinLogoLink, description, imageLink };
-            return req.session.save(error => error ? next(error) : res.redirect('/admin/add-coin-form'));
+            return req.session.save(() => undefined);
         }
     } catch (error) {
killedBy: Groups Controller addCoin should flash an error message if coin already exists in the database
statusReason: expected false to be true

[Killed] BlockStatement
controllers/groups.js:97:9
 }
 
 const updateCoin = async (req, res, next) => {
-    try {
-        const { coin, coinLogoLink, description, imageLink } = req.body;
-        const conditions = { group: req.params.group, 'coins.coin': req.params.coin };
-        const update = {
-            $set: {
-                'coins.$.coin': coin,
-                'coins.$.coinLogoLink': coinLogoLink
-            }
-        };
-
-        const coinData = await Coins.findOne({ coin });
-
-        if (coinData === null || coinData.coin === req.params.coin) {
-            await Groups.updateOne(conditions, update);
-            await Coins.updateOne({ coin: req.params.coin }, { coin, description, imageLink})
-            return res.redirect(`/${encodeURIComponent(req.params.group)}/${encodeURIComponent(req.body.coin)}/admin`);
-        } else {
-            req.flash('error', 'This coin already exists in our database. Please update the existing coin or choose a different name.');
-            return req.session.save(error => error ? next(error) : res.redirect(`/${encodeURIComponent(req.params.group)}/${encodeURIComponent(req.params.coin)}/admin/update-coin-form`)); 
-        }
-
-    } catch (error) {
+    try {} catch (error) {
         next(error);
     }
killedBy: Groups Controller updateCoin should redirect to coin admin page if coin is updated successfully
statusReason: expected false to be true

[Killed] EqualityOperator
controllers/groups.js:109:34
 
         const coinData = await Coins.findOne({ coin });
 
-        if (coinData === null || coinData.coin === req.params.coin) {
+        if (coinData === null || coinData.coin !== req.params.coin) {
             await Groups.updateOne(conditions, update);
             await Coins.updateOne({ coin: req.params.coin }, { coin, description, imageLink})
killedBy: Groups Controller updateCoin should redirect to coin admin page if coin is updated successfully
statusReason: expected false to be true

[Killed] LogicalOperator
controllers/groups.js:109:13
 
         const coinData = await Coins.findOne({ coin });
 
-        if (coinData === null || coinData.coin === req.params.coin) {
+        if (coinData === null && coinData.coin === req.params.coin) {
             await Groups.updateOne(conditions, update);
             await Coins.updateOne({ coin: req.params.coin }, { coin, description, imageLink})
killedBy: Groups Controller updateCoin should redirect to coin admin page if coin is updated successfully
statusReason: expected false to be true

[Survived] ObjectLiteral
controllers/groups.js:111:35
 
         if (coinData === null || coinData.coin === req.params.coin) {
             await Groups.updateOne(conditions, update);
-            await Coins.updateOne({ coin: req.params.coin }, { coin, description, imageLink})
+            await Coins.updateOne({}, { coin, description, imageLink})
             return res.redirect(`/${encodeURIComponent(req.params.group)}/${encodeURIComponent(req.body.coin)}/admin`);
         } else {
