[Killed] BlockStatement
controllers/groups.js:113:16
             await Groups.updateOne(conditions, update);
             await Coins.updateOne({ coin: req.params.coin }, { coin, description, imageLink})
             return res.redirect(`/${encodeURIComponent(req.params.group)}/${encodeURIComponent(req.body.coin)}/admin`);
-        } else {
-            req.flash('error', 'This coin already exists in our database. Please update the existing coin or choose a different name.');
-            return req.session.save(error => error ? next(error) : res.redirect(`/${encodeURIComponent(req.params.group)}/${encodeURIComponent(req.params.coin)}/admin/update-coin-form`)); 
-        }
+        } else {}
 
     } catch (error) {
killedBy: Groups Controller updateCoin should flash an error message if coin name is changed to another existing coin's name
statusReason: expected false to be true

[Killed] ArrowFunction
controllers/groups.js:115:37
             return res.redirect(`/${encodeURIComponent(req.params.group)}/${encodeURIComponent(req.body.coin)}/admin`);
         } else {
             req.flash('error', 'This coin already exists in our database. Please update the existing coin or choose a different name.');
-            return req.session.save(error => error ? next(error) : res.redirect(`/${encodeURIComponent(req.params.group)}/${encodeURIComponent(req.params.coin)}/admin/update-coin-form`)); 
+            return req.session.save(() => undefined); 
         }
 
killedBy: Groups Controller updateCoin should flash an error message if coin name is changed to another existing coin's name
statusReason: expected false to be true

[Killed] BlockStatement
controllers/groups.js:123:46
     }
 };
 
-const deleteCoin = async (req, res, next) => {
-    try {
-        const { group, coin } = req.body;
-        const conditions = { 'coins.coin': coin };
-        const update = { $pull: { coins: { coin }} };
-        await Groups.updateOne (conditions, update);
-        await Coins.deleteOne({ coin });
-        return res.redirect(`/${encodeURIComponent(group)}/admin`);
-    } catch (error) {
-        next(error);
-    }
-}
+const deleteCoin = async (req, res, next) => {}
 
 const groupsController = { fetchGroup, addGroup, updateGroup, deleteGroup, addCoin, updateCoin, deleteCoin };
killedBy: Groups Controller deleteCoin should redirect to admin page if coin is deleted successfully
statusReason: expected false to be true

[Killed] BlockStatement
controllers/groups.js:124:9
 };
 
 const deleteCoin = async (req, res, next) => {
-    try {
-        const { group, coin } = req.body;
-        const conditions = { 'coins.coin': coin };
-        const update = { $pull: { coins: { coin }} };
-        await Groups.updateOne (conditions, update);
-        await Coins.deleteOne({ coin });
-        return res.redirect(`/${encodeURIComponent(group)}/admin`);
-    } catch (error) {
+    try {} catch (error) {
         next(error);
     }
killedBy: Groups Controller deleteCoin should redirect to admin page if coin is deleted successfully
statusReason: expected false to be true

[Survived] ObjectLiteral
controllers/groups.js:129:31
         const conditions = { 'coins.coin': coin };
         const update = { $pull: { coins: { coin }} };
         await Groups.updateOne (conditions, update);
-        await Coins.deleteOne({ coin });
+        await Coins.deleteOne({});
         return res.redirect(`/${encodeURIComponent(group)}/admin`);
     } catch (error) {

[Killed] BlockStatement
controllers/groups.js:131:21
         await Groups.updateOne (conditions, update);
         await Coins.deleteOne({ coin });
         return res.redirect(`/${encodeURIComponent(group)}/admin`);
-    } catch (error) {
-        next(error);
-    }
+    } catch (error) {}
 }
 
killedBy: Groups Controller deleteCoin should call next with an error if database query fails
statusReason: expected false to be true
