[Killed] BlockStatement
middlewares/csrf_protection.js:3:47
 import crypto from 'crypto';
 
-const generateCSRFToken = (req, res, next) => {
-    if (!req.session.csrfToken) {
-      req.session.csrfToken = crypto.randomBytes(16).toString('hex');
-    }
-    res.locals.csrfToken = req.session.csrfToken;
-    next();
-};
+const generateCSRFToken = (req, res, next) => {};
   
 function verifyCSRFToken(req, res, next) {
killedBy: CSRF Token Middleware generateCSRFToken should create a csrf session token if there is none
statusReason: expected undefined to be a string

[Killed] BooleanLiteral
middlewares/csrf_protection.js:4:9
 import crypto from 'crypto';
 
 const generateCSRFToken = (req, res, next) => {
-    if (!req.session.csrfToken) {
+    if (req.session.csrfToken) {
       req.session.csrfToken = crypto.randomBytes(16).toString('hex');
     }
killedBy: CSRF Token Middleware generateCSRFToken should create a csrf session token if there is none
statusReason: expected undefined to be a string

[Killed] ConditionalExpression
middlewares/csrf_protection.js:4:9
 import crypto from 'crypto';
 
 const generateCSRFToken = (req, res, next) => {
-    if (!req.session.csrfToken) {
+    if (true) {
       req.session.csrfToken = crypto.randomBytes(16).toString('hex');
     }
killedBy: CSRF Token Middleware generateCSRFToken should not overwrite an existing csrf session token
statusReason: expected 'd4d0030f69198c05aea083f9e3a1108f' to equal 'existing-token'

[Killed] BlockStatement
middlewares/csrf_protection.js:11:42
     next();
 };
   
-function verifyCSRFToken(req, res, next) {
-    const requestToken = req.body.csrfToken || req.headers['x-csrf-token'];
-    if (requestToken !== req.session.csrfToken) {
-      return res.status(403).send('Invalid CSRF token');
-    }
-    next();
-}
+function verifyCSRFToken(req, res, next) {}
 
 const CSRFProtection = { generateCSRFToken, verifyCSRFToken };
killedBy: CSRF Token Middleware verifyCSRFToken should send a 403 status and an "Invalid CSRF token" message if the token in the session does not match the submitted token
statusReason: expected false to be true

[Killed] ConditionalExpression
middlewares/csrf_protection.js:12:26
 };
   
 function verifyCSRFToken(req, res, next) {
-    const requestToken = req.body.csrfToken || req.headers['x-csrf-token'];
+    const requestToken = true;
     if (requestToken !== req.session.csrfToken) {
       return res.status(403).send('Invalid CSRF token');
killedBy: CSRF Token Middleware verifyCSRFToken should call next if the token in the session matches the submitted token
statusReason: expected false to be true

[Killed] ConditionalExpression
middlewares/csrf_protection.js:12:26
 };
   
 function verifyCSRFToken(req, res, next) {
-    const requestToken = req.body.csrfToken || req.headers['x-csrf-token'];
+    const requestToken = false;
     if (requestToken !== req.session.csrfToken) {
       return res.status(403).send('Invalid CSRF token');
killedBy: CSRF Token Middleware verifyCSRFToken should call next if the token in the session matches the submitted token
statusReason: expected false to be true

[Killed] ConditionalExpression
middlewares/csrf_protection.js:13:9
   
 function verifyCSRFToken(req, res, next) {
     const requestToken = req.body.csrfToken || req.headers['x-csrf-token'];
-    if (requestToken !== req.session.csrfToken) {
+    if (true) {
       return res.status(403).send('Invalid CSRF token');
     }
killedBy: CSRF Token Middleware verifyCSRFToken should call next if the token in the session matches the submitted token
statusReason: expected false to be true

[Killed] BlockStatement
middlewares/csrf_protection.js:13:49
   
 function verifyCSRFToken(req, res, next) {
     const requestToken = req.body.csrfToken || req.headers['x-csrf-token'];
-    if (requestToken !== req.session.csrfToken) {
-      return res.status(403).send('Invalid CSRF token');
-    }
+    if (requestToken !== req.session.csrfToken) {}
     next();
 }
killedBy: CSRF Token Middleware verifyCSRFToken should send a 403 status and an "Invalid CSRF token" message if the token in the session does not match the submitted token
statusReason: expected false to be true
