[Killed] BlockStatement
middlewares/is_auth.js:1:39
-const checkAuth = (req, res, next) => {
-    if (req.session.isLoggedIn === true) {
-        next();
-    } else {
-        res.redirect('/login');
-    }
-}
+const checkAuth = (req, res, next) => {}
 
 export default checkAuth;
killedBy: Is Auth Middleware should call next when the user is logged in
statusReason: expected false to be true

[Killed] BlockStatement
middlewares/is_auth.js:2:42
 const checkAuth = (req, res, next) => {
-    if (req.session.isLoggedIn === true) {
-        next();
-    } else {
+    if (req.session.isLoggedIn === true) {} else {
         res.redirect('/login');
     }
killedBy: Is Auth Middleware should call next when the user is logged in
statusReason: expected false to be true

[Killed] ConditionalExpression
middlewares/is_auth.js:2:9
 const checkAuth = (req, res, next) => {
-    if (req.session.isLoggedIn === true) {
+    if (true) {
         next();
     } else {
killedBy: Is Auth Middleware should redirect to login page and not call next when the user is logged out
statusReason: expected false to be true

[Killed] BlockStatement
middlewares/is_auth.js:4:12
 const checkAuth = (req, res, next) => {
     if (req.session.isLoggedIn === true) {
         next();
-    } else {
-        res.redirect('/login');
-    }
+    } else {}
 }
 
killedBy: Is Auth Middleware should redirect to login page and not call next when the user is logged out
statusReason: expected false to be true

[Killed] StringLiteral
middlewares/is_auth.js:5:22
     if (req.session.isLoggedIn === true) {
         next();
     } else {
-        res.redirect('/login');
+        res.redirect("");
     }
 }
killedBy: Is Auth Middleware should redirect to login page and not call next when the user is logged out
statusReason: expected false to be true
